mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* FTDM_IN30  - Registers (IC 1) */
#define REG_FTDM_IN30_IC_1_ADDR                   0xF31E
#define REG_FTDM_IN30_IC_1_BYTE                   2
#define REG_FTDM_IN30_IC_1_VALUE                  0x0

/* FTDM_IN31  - Registers (IC 1) */
#define REG_FTDM_IN31_IC_1_ADDR                   0xF31F
#define REG_FTDM_IN31_IC_1_BYTE                   2
#define REG_FTDM_IN31_IC_1_VALUE                  0x0

/* FTDM_IN32  - Registers (IC 1) */
#define REG_FTDM_IN32_IC_1_ADDR                   0xF320
#define REG_FTDM_IN32_IC_1_BYTE                   2
#define REG_FTDM_IN32_IC_1_VALUE                  0x0

/* FTDM_IN33  - Registers (IC 1) */
#define REG_FTDM_IN33_IC_1_ADDR                   0xF321
#define REG_FTDM_IN33_IC_1_BYTE                   2
#define REG_FTDM_IN33_IC_1_VALUE                  0x0

/* FTDM_IN34  - Registers (IC 1) */
#define REG_FTDM_IN34_IC_1_ADDR                   0xF322
#define REG_FTDM_IN34_IC_1_BYTE                   2
#define REG_FTDM_IN34_IC_1_VALUE                  0x0

/* FTDM_IN35  - Registers (IC 1) */
#define REG_FTDM_IN35_IC_1_ADDR                   0xF323
#define REG_FTDM_IN35_IC_1_BYTE                   2
#define REG_FTDM_IN35_IC_1_VALUE                  0x0

/* FTDM_IN36  - Registers (IC 1) */
#define REG_FTDM_IN36_IC_1_ADDR                   0xF324
#define REG_FTDM_IN36_IC_1_BYTE                   2
#define REG_FTDM_IN36_IC_1_VALUE                  0x0

/* FTDM_IN37  - Registers (IC 1) */
#define REG_FTDM_IN37_IC_1_ADDR                   0xF325
#define REG_FTDM_IN37_IC_1_BYTE                   2
#define REG_FTDM_IN37_IC_1_VALUE                  0x0

/* FTDM_IN38  - Registers (IC 1) */
#define REG_FTDM_IN38_IC_1_ADDR                   0xF326
#define REG_FTDM_IN38_IC_1_BYTE                   2
#define REG_FTDM_IN38_IC_1_VALUE                  0x0

/* FTDM_IN39  - Registers (IC 1) */
#define REG_FTDM_IN39_IC_1_ADDR                   0xF327
#define REG_FTDM_IN39_IC_1_BYTE                   2
#define REG_FTDM_IN39_IC_1_VALUE                  0x0

/* FTDM_IN40  - Registers (IC 1) */
#define REG_FTDM_IN40_IC_1_ADDR                   0xF328
#define REG_FTDM_IN40_IC_1_BYTE                   2
#define REG_FTDM_IN40_IC_1_VALUE                  0x0

/* FTDM_IN41  - Registers (IC 1) */
#define REG_FTDM_IN41_IC_1_ADDR                   0xF329
#define REG_FTDM_IN41_IC_1_BYTE                   2
#define REG_FTDM_IN41_IC_1_VALUE                  0x0

/* FTDM_IN42  - Registers (IC 1) */
#define REG_FTDM_IN42_IC_1_ADDR                   0xF32A
#define REG_FTDM_IN42_IC_1_BYTE                   2
#define REG_FTDM_IN42_IC_1_VALUE                  0x0

/* FTDM_IN43  - Registers (IC 1) */
#define REG_FTDM_IN43_IC_1_ADDR                   0xF32B
#define REG_FTDM_IN43_IC_1_BYTE                   2
#define REG_FTDM_IN43_IC_1_VALUE                  0x0

/* FTDM_IN44  - Registers (IC 1) */
#define REG_FTDM_IN44_IC_1_ADDR                   0xF32C
#define REG_FTDM_IN44_IC_1_BYTE                   2
#define REG_FTDM_IN44_IC_1_VALUE                  0x0

/* FTDM_IN45  - Registers (IC 1) */
#define REG_FTDM_IN45_IC_1_ADDR                   0xF32D
#define REG_FTDM_IN45_IC_1_BYTE                   2
#define REG_FTDM_IN45_IC_1_VALUE                  0x0

/* FTDM_IN46  - Registers (IC 1) */
#define REG_FTDM_IN46_IC_1_ADDR                   0xF32E
#define REG_FTDM_IN46_IC_1_BYTE                   2
#define REG_FTDM_IN46_IC_1_VALUE                  0x0

/* FTDM_IN47  - Registers (IC 1) */
#define REG_FTDM_IN47_IC_1_ADDR                   0xF32F
#define REG_FTDM_IN47_IC_1_BYTE                   2
#define REG_FTDM_IN47_IC_1_VALUE                  0x0

/* FTDM_IN48  - Registers (IC 1) */
#define REG_FTDM_IN48_IC_1_ADDR                   0xF330
#define REG_FTDM_IN48_IC_1_BYTE                   2
#define REG_FTDM_IN48_IC_1_VALUE                  0x0

/* FTDM_IN49  - Registers (IC 1) */
#define REG_FTDM_IN49_IC_1_ADDR                   0xF331
#define REG_FTDM_IN49_IC_1_BYTE                   2
#define REG_FTDM_IN49_IC_1_VALUE                  0x0

/* FTDM_IN50  - Registers (IC 1) */
#define REG_FTDM_IN50_IC_1_ADDR                   0xF332
#define REG_FTDM_IN50_IC_1_BYTE                   2
#define REG_FTDM_IN50_IC_1_VALUE                  0x0

/* FTDM_IN51  - Registers (IC 1) */
#define REG_FTDM_IN51_IC_1_ADDR                   0xF333
#define REG_FTDM_IN51_IC_1_BYTE                   2
#define REG_FTDM_IN51_IC_1_VALUE                  0x0

/* FTDM_IN52  - Registers (IC 1) */
#define REG_FTDM_IN52_IC_1_ADDR                   0xF334
#define REG_FTDM_IN52_IC_1_BYTE                   2
#define REG_FTDM_IN52_IC_1_VALUE                  0x0

/* FTDM_IN53  - Registers (IC 1) */
#define REG_FTDM_IN53_IC_1_ADDR                   0xF335
#define REG_FTDM_IN53_IC_1_BYTE                   2
#define REG_FTDM_IN53_IC_1_VALUE                  0x0

/* FTDM_IN54  - Registers (IC 1) */
#define REG_FTDM_IN54_IC_1_ADDR                   0xF336
#define REG_FTDM_IN54_IC_1_BYTE                   2
#define REG_FTDM_IN54_IC_1_VALUE                  0x0

/* FTDM_IN55  - Registers (IC 1) */
#define REG_FTDM_IN55_IC_1_ADDR                   0xF337
#define REG_FTDM_IN55_IC_1_BYTE                   2
#define REG_FTDM_IN55_IC_1_VALUE                  0x0

/* FTDM_IN56  - Registers (IC 1) */
#define REG_FTDM_IN56_IC_1_ADDR                   0xF338
#define REG_FTDM_IN56_IC_1_BYTE                   2
#define REG_FTDM_IN56_IC_1_VALUE                  0x0

/* FTDM_IN57  - Registers (IC 1) */
#define REG_FTDM_IN57_IC_1_ADDR                   0xF339
#define REG_FTDM_IN57_IC_1_BYTE                   2
#define REG_FTDM_IN57_IC_1_VALUE                  0x0

/* FTDM_IN58  - Registers (IC 1) */
#define REG_FTDM_IN58_IC_1_ADDR                   0xF33A
#define REG_FTDM_IN58_IC_1_BYTE                   2
#define REG_FTDM_IN58_IC_1_VALUE                  0x0

/* FTDM_IN59  - Registers (IC 1) */
#define REG_FTDM_IN59_IC_1_ADDR                   0xF33B
#define REG_FTDM_IN59_IC_1_BYTE                   2
#define REG_FTDM_IN59_IC_1_VALUE                  0x0

/* FTDM_IN60  - Registers (IC 1) */
#define REG_FTDM_IN60_IC_1_ADDR                   0xF33C
#define REG_FTDM_IN60_IC_1_BYTE                   2
#define REG_FTDM_IN60_IC_1_VALUE                  0x0

/* FTDM_IN61  - Registers (IC 1) */
#define REG_FTDM_IN61_IC_1_ADDR                   0xF33D
#define REG_FTDM_IN61_IC_1_BYTE                   2
#define REG_FTDM_IN61_IC_1_VALUE                  0x0

/* FTDM_IN62  - Registers (IC 1) */
#define REG_FTDM_IN62_IC_1_ADDR                   0xF33E
#define REG_FTDM_IN62_IC_1_BYTE                   2
#define REG_FTDM_IN62_IC_1_VALUE                  0x0

/* FTDM_IN63  - Registers (IC 1) */
#define REG_FTDM_IN63_IC_1_ADDR                   0xF33F
#define REG_FTDM_IN63_IC_1_BYTE                   2
#define REG_FTDM_IN63_IC_1_VALUE                  0x0

/* FTDM_OUT0  - Registers (IC 1) */
#define REG_FTDM_OUT0_IC_1_ADDR                   0xF380
#define REG_FTDM_OUT0_IC_1_BYTE                   2
#define REG_FTDM_OUT0_IC_1_VALUE                  0x0

/* FTDM_OUT1  - Registers (IC 1) */
#define REG_FTDM_OUT1_IC_1_ADDR                   0xF381
#define REG_FTDM_OUT1_IC_1_BYTE                   2
#define REG_FTDM_OUT1_IC_1_VALUE                  0x0

/* FTDM_OUT2  - Registers (IC 1) */
#define REG_FTDM_OUT2_IC_1_ADDR                   0xF382
#define REG_FTDM_OUT2_IC_1_BYTE                   2
#define REG_FTDM_OUT2_IC_1_VALUE                  0x0

/* FTDM_OUT3  - Registers (IC 1) */
#define REG_FTDM_OUT3_IC_1_ADDR                   0xF383
#define REG_FTDM_OUT3_IC_1_BYTE                   2
#define REG_FTDM_OUT3_IC_1_VALUE                  0x0

/* FTDM_OUT4  - Registers (IC 1) */
#define REG_FTDM_OUT4_IC_1_ADDR                   0xF384
#define REG_FTDM_OUT4_IC_1_BYTE                   2
#define REG_FTDM_OUT4_IC_1_VALUE                  0x0

/* FTDM_OUT5  - Registers (IC 1) */
#define REG_FTDM_OUT5_IC_1_ADDR                   0xF385
#define REG_FTDM_OUT5_IC_1_BYTE                   2
#define REG_FTDM_OUT5_IC_1_VALUE                  0x0

/* FTDM_OUT6  - Registers (IC 1) */
#define REG_FTDM_OUT6_IC_1_ADDR                   0xF386
#define REG_FTDM_OUT6_IC_1_BYTE                   2
#define REG_FTDM_OUT6_IC_1_VALUE                  0x0

/* FTDM_OUT7  - Registers (IC 1) */
#define REG_FTDM_OUT7_IC_1_ADDR                   0xF387
#define REG_FTDM_OUT7_IC_1_BYTE                   2
#define REG_FTDM_OUT7_IC_1_VALUE                  0x0

