mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* PANIC_SOFTWARE_MASK  - Registers (IC 1) */
#define REG_PANIC_SOFTWARE_MASK_IC_1_ADDR         0xF423
#define REG_PANIC_SOFTWARE_MASK_IC_1_BYTE         2
#define REG_PANIC_SOFTWARE_MASK_IC_1_VALUE        0x0

/* PANIC_WD_MASK  - Registers (IC 1) */
#define REG_PANIC_WD_MASK_IC_1_ADDR               0xF424
#define REG_PANIC_WD_MASK_IC_1_BYTE               2
#define REG_PANIC_WD_MASK_IC_1_VALUE              0x0

/* PANIC_STACK_MASK  - Registers (IC 1) */
#define REG_PANIC_STACK_MASK_IC_1_ADDR            0xF425
#define REG_PANIC_STACK_MASK_IC_1_BYTE            2
#define REG_PANIC_STACK_MASK_IC_1_VALUE           0x0

/* PANIC_LOOP_MASK  - Registers (IC 1) */
#define REG_PANIC_LOOP_MASK_IC_1_ADDR             0xF426
#define REG_PANIC_LOOP_MASK_IC_1_BYTE             2
#define REG_PANIC_LOOP_MASK_IC_1_VALUE            0x0

/* PANIC_FLAG  - Registers (IC 1) */
#define REG_PANIC_FLAG_IC_1_ADDR                  0xF427
#define REG_PANIC_FLAG_IC_1_BYTE                  0
#define REG_PANIC_FLAG_IC_1_VALUE                 0x0

/* PANIC_CODE  - Registers (IC 1) */
#define REG_PANIC_CODE_IC_1_ADDR                  0xF428
#define REG_PANIC_CODE_IC_1_BYTE                  0
#define REG_PANIC_CODE_IC_1_VALUE                 0x0

/* EXECUTE_COUNT  - Registers (IC 1) */
#define REG_EXECUTE_COUNT_IC_1_ADDR               0xF432
#define REG_EXECUTE_COUNT_IC_1_BYTE               0
#define REG_EXECUTE_COUNT_IC_1_VALUE              0x0

/* WATCHDOG_MAXCOUNT  - Registers (IC 1) */
#define REG_WATCHDOG_MAXCOUNT_IC_1_ADDR           0xF443
#define REG_WATCHDOG_MAXCOUNT_IC_1_BYTE           2
#define REG_WATCHDOG_MAXCOUNT_IC_1_VALUE          0x0

/* WATCHDOG_PRESCALE  - Registers (IC 1) */
#define REG_WATCHDOG_PRESCALE_IC_1_ADDR           0xF444
#define REG_WATCHDOG_PRESCALE_IC_1_BYTE           2
#define REG_WATCHDOG_PRESCALE_IC_1_VALUE          0x0

/* BLOCKINT_EN  - Registers (IC 1) */
#define REG_BLOCKINT_EN_IC_1_ADDR                 0xF450
#define REG_BLOCKINT_EN_IC_1_BYTE                 2
#define REG_BLOCKINT_EN_IC_1_VALUE                0x0

/* BLOCKINT_VALUE  - Registers (IC 1) */
#define REG_BLOCKINT_VALUE_IC_1_ADDR              0xF451
#define REG_BLOCKINT_VALUE_IC_1_BYTE              2
#define REG_BLOCKINT_VALUE_IC_1_VALUE             0x0

/* PROG_CNTR0  - Registers (IC 1) */
#define REG_PROG_CNTR0_IC_1_ADDR                  0xF460
#define REG_PROG_CNTR0_IC_1_BYTE                  0
#define REG_PROG_CNTR0_IC_1_VALUE                 0x0

/* PROG_CNTR1  - Registers (IC 1) */
#define REG_PROG_CNTR1_IC_1_ADDR                  0xF461
#define REG_PROG_CNTR1_IC_1_BYTE                  0
#define REG_PROG_CNTR1_IC_1_VALUE                 0x0

/* PROG_CNTR_CLEAR  - Registers (IC 1) */
#define REG_PROG_CNTR_CLEAR_IC_1_ADDR             0xF462
#define REG_PROG_CNTR_CLEAR_IC_1_BYTE             2
#define REG_PROG_CNTR_CLEAR_IC_1_VALUE            0x0

/* PROG_CNTR_LENGTH0  - Registers (IC 1) */
#define REG_PROG_CNTR_LENGTH0_IC_1_ADDR           0xF463
#define REG_PROG_CNTR_LENGTH0_IC_1_BYTE           0
#define REG_PROG_CNTR_LENGTH0_IC_1_VALUE          0x0

/* PROG_CNTR_LENGTH1  - Registers (IC 1) */
#define REG_PROG_CNTR_LENGTH1_IC_1_ADDR           0xF464
#define REG_PROG_CNTR_LENGTH1_IC_1_BYTE           0
#define REG_PROG_CNTR_LENGTH1_IC_1_VALUE          0x0

/* PROG_CNTR_MAXLENGTH0  - Registers (IC 1) */
#define REG_PROG_CNTR_MAXLENGTH0_IC_1_ADDR        0xF465
#define REG_PROG_CNTR_MAXLENGTH0_IC_1_BYTE        0
#define REG_PROG_CNTR_MAXLENGTH0_IC_1_VALUE       0x0

/* PROG_CNTR_MAXLENGTH1  - Registers (IC 1) */
#define REG_PROG_CNTR_MAXLENGTH1_IC_1_ADDR        0xF466
#define REG_PROG_CNTR_MAXLENGTH1_IC_1_BYTE        0
#define REG_PROG_CNTR_MAXLENGTH1_IC_1_VALUE       0x0

/* PANIC_PARITY_MASK1  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK1_IC_1_ADDR          0xF467
#define REG_PANIC_PARITY_MASK1_IC_1_BYTE          2
#define REG_PANIC_PARITY_MASK1_IC_1_VALUE         0x0

/* PANIC_PARITY_MASK2  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK2_IC_1_ADDR          0xF468
#define REG_PANIC_PARITY_MASK2_IC_1_BYTE          2
#define REG_PANIC_PARITY_MASK2_IC_1_VALUE         0x0

/* PANIC_PARITY_MASK3  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK3_IC_1_ADDR          0xF469
#define REG_PANIC_PARITY_MASK3_IC_1_BYTE          2
#define REG_PANIC_PARITY_MASK3_IC_1_VALUE         0x0

/* PANIC_PARITY_MASK4  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK4_IC_1_ADDR          0xF46A
#define REG_PANIC_PARITY_MASK4_IC_1_BYTE          2
#define REG_PANIC_PARITY_MASK4_IC_1_VALUE         0x0

/* PANIC_PARITY_MASK5  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK5_IC_1_ADDR          0xF46B
#define REG_PANIC_PARITY_MASK5_IC_1_BYTE          2
#define REG_PANIC_PARITY_MASK5_IC_1_VALUE         0x0

/* PANIC_CODE1  - Registers (IC 1) */
#define REG_PANIC_CODE1_IC_1_ADDR                 0xF46C
#define REG_PANIC_CODE1_IC_1_BYTE                 0
#define REG_PANIC_CODE1_IC_1_VALUE                0x0

/* PANIC_CODE2  - Registers (IC 1) */
#define REG_PANIC_CODE2_IC_1_ADDR                 0xF46D
#define REG_PANIC_CODE2_IC_1_BYTE                 0
#define REG_PANIC_CODE2_IC_1_VALUE                0x0

/* PANIC_CODE3  - Registers (IC 1) */
#define REG_PANIC_CODE3_IC_1_ADDR                 0xF46E
#define REG_PANIC_CODE3_IC_1_BYTE                 0
#define REG_PANIC_CODE3_IC_1_VALUE                0x0

/* PANIC_CODE4  - Registers (IC 1) */
#define REG_PANIC_CODE4_IC_1_ADDR                 0xF46F
#define REG_PANIC_CODE4_IC_1_BYTE                 0
#define REG_PANIC_CODE4_IC_1_VALUE                0x0

/* PANIC_CODE5  - Registers (IC 1) */
#define REG_PANIC_CODE5_IC_1_ADDR                 0xF470
#define REG_PANIC_CODE5_IC_1_BYTE                 0
#define REG_PANIC_CODE5_IC_1_VALUE                0x0

/* MP0_MODE  - Registers (IC 1) */
#define REG_MP0_MODE_IC_1_ADDR                    0xF510
#define REG_MP0_MODE_IC_1_BYTE                    2
#define REG_MP0_MODE_IC_1_VALUE                   0x1

/* MP1_MODE  - Registers (IC 1) */
#define REG_MP1_MODE_IC_1_ADDR                    0xF511
#define REG_MP1_MODE_IC_1_BYTE                    2
#define REG_MP1_MODE_IC_1_VALUE                   0x1

/* MP2_MODE  - Registers (IC 1) */
#define REG_MP2_MODE_IC_1_ADDR                    0xF512
#define REG_MP2_MODE_IC_1_BYTE                    2
#define REG_MP2_MODE_IC_1_VALUE                   0x1

/* MP3_MODE  - Registers (IC 1) */
#define REG_MP3_MODE_IC_1_ADDR                    0xF513
#define REG_MP3_MODE_IC_1_BYTE                    2
#define REG_MP3_MODE_IC_1_VALUE                   0x1

/* MP4_MODE  - Registers (IC 1) */
#define REG_MP4_MODE_IC_1_ADDR                    0xF514
#define REG_MP4_MODE_IC_1_BYTE                    2
#define REG_MP4_MODE_IC_1_VALUE                   0x0

/* MP5_MODE  - Registers (IC 1) */
#define REG_MP5_MODE_IC_1_ADDR                    0xF515
#define REG_MP5_MODE_IC_1_BYTE                    2
#define REG_MP5_MODE_IC_1_VALUE                   0x0

/* MP6_MODE  - Registers (IC 1) */
#define REG_MP6_MODE_IC_1_ADDR                    0xF516
#define REG_MP6_MODE_IC_1_BYTE                    2
#define REG_MP6_MODE_IC_1_VALUE                   0x7

/* MP7_MODE  - Registers (IC 1) */
#define REG_MP7_MODE_IC_1_ADDR                    0xF517
#define REG_MP7_MODE_IC_1_BYTE                    2
#define REG_MP7_MODE_IC_1_VALUE                   0x1

/* MP8_MODE  - Registers (IC 1) */
#define REG_MP8_MODE_IC_1_ADDR                    0xF518
#define REG_MP8_MODE_IC_1_BYTE                    2
#define REG_MP8_MODE_IC_1_VALUE                   0x0

/* MP9_MODE  - Registers (IC 1) */
#define REG_MP9_MODE_IC_1_ADDR                    0xF519
#define REG_MP9_MODE_IC_1_BYTE                    2
#define REG_MP9_MODE_IC_1_VALUE                   0x0

/* MP10_MODE  - Registers (IC 1) */
#define REG_MP10_MODE_IC_1_ADDR                   0xF51A
#define REG_MP10_MODE_IC_1_BYTE                   2
#define REG_MP10_MODE_IC_1_VALUE                  0x0

/* MP11_MODE  - Registers (IC 1) */
#define REG_MP11_MODE_IC_1_ADDR                   0xF51B
#define REG_MP11_MODE_IC_1_BYTE                   2
#define REG_MP11_MODE_IC_1_VALUE                  0x0

/* MP12_MODE  - Registers (IC 1) */
#define REG_MP12_MODE_IC_1_ADDR                   0xF51C
#define REG_MP12_MODE_IC_1_BYTE                   2
#define REG_MP12_MODE_IC_1_VALUE                  0x0

/* MP13_MODE  - Registers (IC 1) */
#define REG_MP13_MODE_IC_1_ADDR                   0xF51D
#define REG_MP13_MODE_IC_1_BYTE                   2
#define REG_MP13_MODE_IC_1_VALUE                  0x0

