mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* MP0_WRITE  - Registers (IC 1) */
#define REG_MP0_WRITE_IC_1_ADDR                   0xF520
#define REG_MP0_WRITE_IC_1_BYTE                   2
#define REG_MP0_WRITE_IC_1_VALUE                  0x0

/* MP1_WRITE  - Registers (IC 1) */
#define REG_MP1_WRITE_IC_1_ADDR                   0xF521
#define REG_MP1_WRITE_IC_1_BYTE                   2
#define REG_MP1_WRITE_IC_1_VALUE                  0x0

/* MP2_WRITE  - Registers (IC 1) */
#define REG_MP2_WRITE_IC_1_ADDR                   0xF522
#define REG_MP2_WRITE_IC_1_BYTE                   2
#define REG_MP2_WRITE_IC_1_VALUE                  0x0

/* MP3_WRITE  - Registers (IC 1) */
#define REG_MP3_WRITE_IC_1_ADDR                   0xF523
#define REG_MP3_WRITE_IC_1_BYTE                   2
#define REG_MP3_WRITE_IC_1_VALUE                  0x0

/* MP4_WRITE  - Registers (IC 1) */
#define REG_MP4_WRITE_IC_1_ADDR                   0xF524
#define REG_MP4_WRITE_IC_1_BYTE                   2
#define REG_MP4_WRITE_IC_1_VALUE                  0x0

/* MP5_WRITE  - Registers (IC 1) */
#define REG_MP5_WRITE_IC_1_ADDR                   0xF525
#define REG_MP5_WRITE_IC_1_BYTE                   2
#define REG_MP5_WRITE_IC_1_VALUE                  0x0

/* MP6_WRITE  - Registers (IC 1) */
#define REG_MP6_WRITE_IC_1_ADDR                   0xF526
#define REG_MP6_WRITE_IC_1_BYTE                   2
#define REG_MP6_WRITE_IC_1_VALUE                  0x0

/* MP7_WRITE  - Registers (IC 1) */
#define REG_MP7_WRITE_IC_1_ADDR                   0xF527
#define REG_MP7_WRITE_IC_1_BYTE                   2
#define REG_MP7_WRITE_IC_1_VALUE                  0x0

/* MP8_WRITE  - Registers (IC 1) */
#define REG_MP8_WRITE_IC_1_ADDR                   0xF528
#define REG_MP8_WRITE_IC_1_BYTE                   2
#define REG_MP8_WRITE_IC_1_VALUE                  0x0

/* MP9_WRITE  - Registers (IC 1) */
#define REG_MP9_WRITE_IC_1_ADDR                   0xF529
#define REG_MP9_WRITE_IC_1_BYTE                   2
#define REG_MP9_WRITE_IC_1_VALUE                  0x0

/* MP10_WRITE  - Registers (IC 1) */
#define REG_MP10_WRITE_IC_1_ADDR                  0xF52A
#define REG_MP10_WRITE_IC_1_BYTE                  2
#define REG_MP10_WRITE_IC_1_VALUE                 0x0

/* MP11_WRITE  - Registers (IC 1) */
#define REG_MP11_WRITE_IC_1_ADDR                  0xF52B
#define REG_MP11_WRITE_IC_1_BYTE                  2
#define REG_MP11_WRITE_IC_1_VALUE                 0x0

/* MP12_WRITE  - Registers (IC 1) */
#define REG_MP12_WRITE_IC_1_ADDR                  0xF52C
#define REG_MP12_WRITE_IC_1_BYTE                  2
#define REG_MP12_WRITE_IC_1_VALUE                 0x0

/* MP13_WRITE  - Registers (IC 1) */
#define REG_MP13_WRITE_IC_1_ADDR                  0xF52D
#define REG_MP13_WRITE_IC_1_BYTE                  2
#define REG_MP13_WRITE_IC_1_VALUE                 0x0

/* MP0_READ  - Registers (IC 1) */
#define REG_MP0_READ_IC_1_ADDR                    0xF530
#define REG_MP0_READ_IC_1_BYTE                    0
#define REG_MP0_READ_IC_1_VALUE                   0x0

/* MP1_READ  - Registers (IC 1) */
#define REG_MP1_READ_IC_1_ADDR                    0xF531
#define REG_MP1_READ_IC_1_BYTE                    0
#define REG_MP1_READ_IC_1_VALUE                   0x0

/* MP2_READ  - Registers (IC 1) */
#define REG_MP2_READ_IC_1_ADDR                    0xF532
#define REG_MP2_READ_IC_1_BYTE                    0
#define REG_MP2_READ_IC_1_VALUE                   0x0

/* MP3_READ  - Registers (IC 1) */
#define REG_MP3_READ_IC_1_ADDR                    0xF533
#define REG_MP3_READ_IC_1_BYTE                    0
#define REG_MP3_READ_IC_1_VALUE                   0x0

/* MP4_READ  - Registers (IC 1) */
#define REG_MP4_READ_IC_1_ADDR                    0xF534
#define REG_MP4_READ_IC_1_BYTE                    0
#define REG_MP4_READ_IC_1_VALUE                   0x0

/* MP5_READ  - Registers (IC 1) */
#define REG_MP5_READ_IC_1_ADDR                    0xF535
#define REG_MP5_READ_IC_1_BYTE                    0
#define REG_MP5_READ_IC_1_VALUE                   0x0

/* MP6_READ  - Registers (IC 1) */
#define REG_MP6_READ_IC_1_ADDR                    0xF536
#define REG_MP6_READ_IC_1_BYTE                    0
#define REG_MP6_READ_IC_1_VALUE                   0x0

/* MP7_READ  - Registers (IC 1) */
#define REG_MP7_READ_IC_1_ADDR                    0xF537
#define REG_MP7_READ_IC_1_BYTE                    0
#define REG_MP7_READ_IC_1_VALUE                   0x0

/* MP8_READ  - Registers (IC 1) */
#define REG_MP8_READ_IC_1_ADDR                    0xF538
#define REG_MP8_READ_IC_1_BYTE                    0
#define REG_MP8_READ_IC_1_VALUE                   0x0

/* MP9_READ  - Registers (IC 1) */
#define REG_MP9_READ_IC_1_ADDR                    0xF539
#define REG_MP9_READ_IC_1_BYTE                    0
#define REG_MP9_READ_IC_1_VALUE                   0x0

/* MP10_READ  - Registers (IC 1) */
#define REG_MP10_READ_IC_1_ADDR                   0xF53A
#define REG_MP10_READ_IC_1_BYTE                   0
#define REG_MP10_READ_IC_1_VALUE                  0x0

/* MP11_READ  - Registers (IC 1) */
#define REG_MP11_READ_IC_1_ADDR                   0xF53B
#define REG_MP11_READ_IC_1_BYTE                   0
#define REG_MP11_READ_IC_1_VALUE                  0x0

/* MP12_READ  - Registers (IC 1) */
#define REG_MP12_READ_IC_1_ADDR                   0xF53C
#define REG_MP12_READ_IC_1_BYTE                   0
#define REG_MP12_READ_IC_1_VALUE                  0x0

/* MP13_READ  - Registers (IC 1) */
#define REG_MP13_READ_IC_1_ADDR                   0xF53D
#define REG_MP13_READ_IC_1_BYTE                   0
#define REG_MP13_READ_IC_1_VALUE                  0x0

/* DMIC_CTRL0  - Registers (IC 1) */
#define REG_DMIC_CTRL0_IC_1_ADDR                  0xF560
#define REG_DMIC_CTRL0_IC_1_BYTE                  2
#define REG_DMIC_CTRL0_IC_1_VALUE                 0x4000

/* DMIC_CTRL1  - Registers (IC 1) */
#define REG_DMIC_CTRL1_IC_1_ADDR                  0xF561
#define REG_DMIC_CTRL1_IC_1_BYTE                  2
#define REG_DMIC_CTRL1_IC_1_VALUE                 0x4000

/* ASRC_LOCK  - Registers (IC 1) */
#define REG_ASRC_LOCK_IC_1_ADDR                   0xF580
#define REG_ASRC_LOCK_IC_1_BYTE                   0
#define REG_ASRC_LOCK_IC_1_VALUE                  0x0

/* ASRC_MUTE  - Registers (IC 1) */
#define REG_ASRC_MUTE_IC_1_ADDR                   0xF581
#define REG_ASRC_MUTE_IC_1_BYTE                   2
#define REG_ASRC_MUTE_IC_1_VALUE                  0x0

/* ASRC0_RATIO  - Registers (IC 1) */
#define REG_ASRC0_RATIO_IC_1_ADDR                 0xF582
#define REG_ASRC0_RATIO_IC_1_BYTE                 0
#define REG_ASRC0_RATIO_IC_1_VALUE                0x0

/* ASRC1_RATIO  - Registers (IC 1) */
#define REG_ASRC1_RATIO_IC_1_ADDR                 0xF583
#define REG_ASRC1_RATIO_IC_1_BYTE                 0
#define REG_ASRC1_RATIO_IC_1_VALUE                0x0

/* ASRC2_RATIO  - Registers (IC 1) */
#define REG_ASRC2_RATIO_IC_1_ADDR                 0xF584
#define REG_ASRC2_RATIO_IC_1_BYTE                 0
#define REG_ASRC2_RATIO_IC_1_VALUE                0x0

/* ASRC3_RATIO  - Registers (IC 1) */
#define REG_ASRC3_RATIO_IC_1_ADDR                 0xF585
#define REG_ASRC3_RATIO_IC_1_BYTE                 0
#define REG_ASRC3_RATIO_IC_1_VALUE                0x0

/* ASRC4_RATIO  - Registers (IC 1) */
#define REG_ASRC4_RATIO_IC_1_ADDR                 0xF586
#define REG_ASRC4_RATIO_IC_1_BYTE                 0
#define REG_ASRC4_RATIO_IC_1_VALUE                0x0

/* ASRC5_RATIO  - Registers (IC 1) */
#define REG_ASRC5_RATIO_IC_1_ADDR                 0xF587
#define REG_ASRC5_RATIO_IC_1_BYTE                 0
#define REG_ASRC5_RATIO_IC_1_VALUE                0x0

/* ASRC6_RATIO  - Registers (IC 1) */
#define REG_ASRC6_RATIO_IC_1_ADDR                 0xF588
#define REG_ASRC6_RATIO_IC_1_BYTE                 0
#define REG_ASRC6_RATIO_IC_1_VALUE                0x0

/* ASRC7_RATIO  - Registers (IC 1) */
#define REG_ASRC7_RATIO_IC_1_ADDR                 0xF589
#define REG_ASRC7_RATIO_IC_1_BYTE                 0
#define REG_ASRC7_RATIO_IC_1_VALUE                0x0

/* ASRC_RAMPMAX_OVR  - Registers (IC 1) */
#define REG_ASRC_RAMPMAX_OVR_IC_1_ADDR            0xF590
#define REG_ASRC_RAMPMAX_OVR_IC_1_BYTE            2
#define REG_ASRC_RAMPMAX_OVR_IC_1_VALUE           0x7FF

/* ASRC0_RAMPMAX  - Registers (IC 1) */
#define REG_ASRC0_RAMPMAX_IC_1_ADDR               0xF591
#define REG_ASRC0_RAMPMAX_IC_1_BYTE               2
#define REG_ASRC0_RAMPMAX_IC_1_VALUE              0x7FF

/* ASRC1_RAMPMAX  - Registers (IC 1) */
#define REG_ASRC1_RAMPMAX_IC_1_ADDR               0xF592
#define REG_ASRC1_RAMPMAX_IC_1_BYTE               2
#define REG_ASRC1_RAMPMAX_IC_1_VALUE              0x7FF

/* ASRC2_RAMPMAX  - Registers (IC 1) */
#define REG_ASRC2_RAMPMAX_IC_1_ADDR               0xF593
#define REG_ASRC2_RAMPMAX_IC_1_BYTE               2
#define REG_ASRC2_RAMPMAX_IC_1_VALUE              0x7FF

