mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* SPDIF_RX_CS_LEFT_9  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_9_IC_1_ADDR          0xF619
#define REG_SPDIF_RX_CS_LEFT_9_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_9_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_10  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_10_IC_1_ADDR         0xF61A
#define REG_SPDIF_RX_CS_LEFT_10_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_LEFT_10_IC_1_VALUE        0x0

/* SPDIF_RX_CS_LEFT_11  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_11_IC_1_ADDR         0xF61B
#define REG_SPDIF_RX_CS_LEFT_11_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_LEFT_11_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_0_IC_1_ADDR         0xF620
#define REG_SPDIF_RX_CS_RIGHT_0_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_0_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_1_IC_1_ADDR         0xF621
#define REG_SPDIF_RX_CS_RIGHT_1_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_1_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_2  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_2_IC_1_ADDR         0xF622
#define REG_SPDIF_RX_CS_RIGHT_2_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_2_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_3  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_3_IC_1_ADDR         0xF623
#define REG_SPDIF_RX_CS_RIGHT_3_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_3_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_4  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_4_IC_1_ADDR         0xF624
#define REG_SPDIF_RX_CS_RIGHT_4_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_4_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_5  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_5_IC_1_ADDR         0xF625
#define REG_SPDIF_RX_CS_RIGHT_5_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_5_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_6  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_6_IC_1_ADDR         0xF626
#define REG_SPDIF_RX_CS_RIGHT_6_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_6_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_7  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_7_IC_1_ADDR         0xF627
#define REG_SPDIF_RX_CS_RIGHT_7_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_7_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_8  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_8_IC_1_ADDR         0xF628
#define REG_SPDIF_RX_CS_RIGHT_8_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_8_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_9  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_9_IC_1_ADDR         0xF629
#define REG_SPDIF_RX_CS_RIGHT_9_IC_1_BYTE         0
#define REG_SPDIF_RX_CS_RIGHT_9_IC_1_VALUE        0x0

/* SPDIF_RX_CS_RIGHT_10  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_10_IC_1_ADDR        0xF62A
#define REG_SPDIF_RX_CS_RIGHT_10_IC_1_BYTE        0
#define REG_SPDIF_RX_CS_RIGHT_10_IC_1_VALUE       0x0

/* SPDIF_RX_CS_RIGHT_11  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_RIGHT_11_IC_1_ADDR        0xF62B
#define REG_SPDIF_RX_CS_RIGHT_11_IC_1_BYTE        0
#define REG_SPDIF_RX_CS_RIGHT_11_IC_1_VALUE       0x0

/* SPDIF_RX_UD_LEFT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_0_IC_1_ADDR          0xF630
#define REG_SPDIF_RX_UD_LEFT_0_IC_1_BYTE          0
#define REG_SPDIF_RX_UD_LEFT_0_IC_1_VALUE         0x0

/* SPDIF_RX_UD_LEFT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_1_IC_1_ADDR          0xF631
#define REG_SPDIF_RX_UD_LEFT_1_IC_1_BYTE          0
#define REG_SPDIF_RX_UD_LEFT_1_IC_1_VALUE         0x0

/* SPDIF_RX_UD_LEFT_2  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_2_IC_1_ADDR          0xF632
#define REG_SPDIF_RX_UD_LEFT_2_IC_1_BYTE          0
#define REG_SPDIF_RX_UD_LEFT_2_IC_1_VALUE         0x0

/* SPDIF_RX_UD_LEFT_3  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_3_IC_1_ADDR          0xF633
#define REG_SPDIF_RX_UD_LEFT_3_IC_1_BYTE          0
#define REG_SPDIF_RX_UD_LEFT_3_IC_1_VALUE         0x0

/* SPDIF_RX_UD_LEFT_4  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_4_IC_1_ADDR          0xF634
#define REG_SPDIF_RX_UD_LEFT_4_IC_1_BYTE          0
#define REG_SPDIF_RX_UD_LEFT_4_IC_1_VALUE         0x0

/* SPDIF_RX_UD_LEFT_5  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_5_IC_1_ADDR          0xF635
#define REG_SPDIF_RX_UD_LEFT_5_IC_1_BYTE          0
#define REG_SPDIF_RX_UD_LEFT_5_IC_1_VALUE         0x0

/* SPDIF_RX_UD_LEFT_6  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_6_IC_1_ADDR          0xF636
#define REG_SPDIF_RX_UD_LEFT_6_IC_1_BYTE          0
#define REG_SPDIF_RX_UD_LEFT_6_IC_1_VALUE         0x0

/* SPDIF_RX_UD_LEFT_7  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_7_IC_1_ADDR          0xF637
#define REG_SPDIF_RX_UD_LEFT_7_IC_1_BYTE          0
#define REG_SPDIF_RX_UD_LEFT_7_IC_1_VALUE         0x0

/* SPDIF_RX_UD_LEFT_8  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_8_IC_1_ADDR          0xF638
#define REG_SPDIF_RX_UD_LEFT_8_IC_1_BYTE          0
#define REG_SPDIF_RX_UD_LEFT_8_IC_1_VALUE         0x0

/* SPDIF_RX_UD_LEFT_9  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_9_IC_1_ADDR          0xF639
#define REG_SPDIF_RX_UD_LEFT_9_IC_1_BYTE          0
#define REG_SPDIF_RX_UD_LEFT_9_IC_1_VALUE         0x0

/* SPDIF_RX_UD_LEFT_10  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_10_IC_1_ADDR         0xF63A
#define REG_SPDIF_RX_UD_LEFT_10_IC_1_BYTE         0
#define REG_SPDIF_RX_UD_LEFT_10_IC_1_VALUE        0x0

/* SPDIF_RX_UD_LEFT_11  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_LEFT_11_IC_1_ADDR         0xF63B
#define REG_SPDIF_RX_UD_LEFT_11_IC_1_BYTE         0
#define REG_SPDIF_RX_UD_LEFT_11_IC_1_VALUE        0x0

/* SPDIF_RX_UD_RIGHT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_RIGHT_0_IC_1_ADDR         0xF640
#define REG_SPDIF_RX_UD_RIGHT_0_IC_1_BYTE         0
#define REG_SPDIF_RX_UD_RIGHT_0_IC_1_VALUE        0x0

/* SPDIF_RX_UD_RIGHT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_UD_RIGHT_1_IC_1_ADDR         0xF641
#define REG_SPDIF_RX_UD_RIGHT_1_IC_1_BYTE         0
#define REG_SPDIF_RX_UD_RIGHT_1_IC_1_VALUE        0x0

