mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* SPDIF_TX_CS_LEFT_8  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_8_IC_1_ADDR          0xF6A8
#define REG_SPDIF_TX_CS_LEFT_8_IC_1_BYTE          2
#define REG_SPDIF_TX_CS_LEFT_8_IC_1_VALUE         0x0

/* SPDIF_TX_CS_LEFT_9  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_9_IC_1_ADDR          0xF6A9
#define REG_SPDIF_TX_CS_LEFT_9_IC_1_BYTE          2
#define REG_SPDIF_TX_CS_LEFT_9_IC_1_VALUE         0x0

/* SPDIF_TX_CS_LEFT_10  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_10_IC_1_ADDR         0xF6AA
#define REG_SPDIF_TX_CS_LEFT_10_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_LEFT_10_IC_1_VALUE        0x0

/* SPDIF_TX_CS_LEFT_11  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_11_IC_1_ADDR         0xF6AB
#define REG_SPDIF_TX_CS_LEFT_11_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_LEFT_11_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_0  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_0_IC_1_ADDR         0xF6B0
#define REG_SPDIF_TX_CS_RIGHT_0_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_RIGHT_0_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_1  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_1_IC_1_ADDR         0xF6B1
#define REG_SPDIF_TX_CS_RIGHT_1_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_RIGHT_1_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_2  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_2_IC_1_ADDR         0xF6B2
#define REG_SPDIF_TX_CS_RIGHT_2_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_RIGHT_2_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_3  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_3_IC_1_ADDR         0xF6B3
#define REG_SPDIF_TX_CS_RIGHT_3_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_RIGHT_3_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_4  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_4_IC_1_ADDR         0xF6B4
#define REG_SPDIF_TX_CS_RIGHT_4_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_RIGHT_4_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_5  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_5_IC_1_ADDR         0xF6B5
#define REG_SPDIF_TX_CS_RIGHT_5_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_RIGHT_5_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_6  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_6_IC_1_ADDR         0xF6B6
#define REG_SPDIF_TX_CS_RIGHT_6_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_RIGHT_6_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_7  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_7_IC_1_ADDR         0xF6B7
#define REG_SPDIF_TX_CS_RIGHT_7_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_RIGHT_7_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_8  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_8_IC_1_ADDR         0xF6B8
#define REG_SPDIF_TX_CS_RIGHT_8_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_RIGHT_8_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_9  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_9_IC_1_ADDR         0xF6B9
#define REG_SPDIF_TX_CS_RIGHT_9_IC_1_BYTE         2
#define REG_SPDIF_TX_CS_RIGHT_9_IC_1_VALUE        0x0

/* SPDIF_TX_CS_RIGHT_10  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_10_IC_1_ADDR        0xF6BA
#define REG_SPDIF_TX_CS_RIGHT_10_IC_1_BYTE        2
#define REG_SPDIF_TX_CS_RIGHT_10_IC_1_VALUE       0x0

/* SPDIF_TX_CS_RIGHT_11  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_RIGHT_11_IC_1_ADDR        0xF6BB
#define REG_SPDIF_TX_CS_RIGHT_11_IC_1_BYTE        2
#define REG_SPDIF_TX_CS_RIGHT_11_IC_1_VALUE       0x0

/* SPDIF_TX_UD_LEFT_0  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_0_IC_1_ADDR          0xF6C0
#define REG_SPDIF_TX_UD_LEFT_0_IC_1_BYTE          2
#define REG_SPDIF_TX_UD_LEFT_0_IC_1_VALUE         0x0

/* SPDIF_TX_UD_LEFT_1  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_1_IC_1_ADDR          0xF6C1
#define REG_SPDIF_TX_UD_LEFT_1_IC_1_BYTE          2
#define REG_SPDIF_TX_UD_LEFT_1_IC_1_VALUE         0x0

/* SPDIF_TX_UD_LEFT_2  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_2_IC_1_ADDR          0xF6C2
#define REG_SPDIF_TX_UD_LEFT_2_IC_1_BYTE          2
#define REG_SPDIF_TX_UD_LEFT_2_IC_1_VALUE         0x0

/* SPDIF_TX_UD_LEFT_3  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_3_IC_1_ADDR          0xF6C3
#define REG_SPDIF_TX_UD_LEFT_3_IC_1_BYTE          2
#define REG_SPDIF_TX_UD_LEFT_3_IC_1_VALUE         0x0

/* SPDIF_TX_UD_LEFT_4  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_4_IC_1_ADDR          0xF6C4
#define REG_SPDIF_TX_UD_LEFT_4_IC_1_BYTE          2
#define REG_SPDIF_TX_UD_LEFT_4_IC_1_VALUE         0x0

/* SPDIF_TX_UD_LEFT_5  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_5_IC_1_ADDR          0xF6C5
#define REG_SPDIF_TX_UD_LEFT_5_IC_1_BYTE          2
#define REG_SPDIF_TX_UD_LEFT_5_IC_1_VALUE         0x0

/* SPDIF_TX_UD_LEFT_6  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_6_IC_1_ADDR          0xF6C6
#define REG_SPDIF_TX_UD_LEFT_6_IC_1_BYTE          2
#define REG_SPDIF_TX_UD_LEFT_6_IC_1_VALUE         0x0

/* SPDIF_TX_UD_LEFT_7  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_7_IC_1_ADDR          0xF6C7
#define REG_SPDIF_TX_UD_LEFT_7_IC_1_BYTE          2
#define REG_SPDIF_TX_UD_LEFT_7_IC_1_VALUE         0x0

/* SPDIF_TX_UD_LEFT_8  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_8_IC_1_ADDR          0xF6C8
#define REG_SPDIF_TX_UD_LEFT_8_IC_1_BYTE          2
#define REG_SPDIF_TX_UD_LEFT_8_IC_1_VALUE         0x0

/* SPDIF_TX_UD_LEFT_9  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_9_IC_1_ADDR          0xF6C9
#define REG_SPDIF_TX_UD_LEFT_9_IC_1_BYTE          2
#define REG_SPDIF_TX_UD_LEFT_9_IC_1_VALUE         0x0

/* SPDIF_TX_UD_LEFT_10  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_10_IC_1_ADDR         0xF6CA
#define REG_SPDIF_TX_UD_LEFT_10_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_LEFT_10_IC_1_VALUE        0x0

/* SPDIF_TX_UD_LEFT_11  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_LEFT_11_IC_1_ADDR         0xF6CB
#define REG_SPDIF_TX_UD_LEFT_11_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_LEFT_11_IC_1_VALUE        0x0

/* SPDIF_TX_UD_RIGHT_0  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_0_IC_1_ADDR         0xF6D0
#define REG_SPDIF_TX_UD_RIGHT_0_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_RIGHT_0_IC_1_VALUE        0x0

