mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* SPDIF_TX_UD_RIGHT_1  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_1_IC_1_ADDR         0xF6D1
#define REG_SPDIF_TX_UD_RIGHT_1_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_RIGHT_1_IC_1_VALUE        0x0

/* SPDIF_TX_UD_RIGHT_2  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_2_IC_1_ADDR         0xF6D2
#define REG_SPDIF_TX_UD_RIGHT_2_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_RIGHT_2_IC_1_VALUE        0x0

/* SPDIF_TX_UD_RIGHT_3  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_3_IC_1_ADDR         0xF6D3
#define REG_SPDIF_TX_UD_RIGHT_3_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_RIGHT_3_IC_1_VALUE        0x0

/* SPDIF_TX_UD_RIGHT_4  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_4_IC_1_ADDR         0xF6D4
#define REG_SPDIF_TX_UD_RIGHT_4_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_RIGHT_4_IC_1_VALUE        0x0

/* SPDIF_TX_UD_RIGHT_5  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_5_IC_1_ADDR         0xF6D5
#define REG_SPDIF_TX_UD_RIGHT_5_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_RIGHT_5_IC_1_VALUE        0x0

/* SPDIF_TX_UD_RIGHT_6  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_6_IC_1_ADDR         0xF6D6
#define REG_SPDIF_TX_UD_RIGHT_6_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_RIGHT_6_IC_1_VALUE        0x0

/* SPDIF_TX_UD_RIGHT_7  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_7_IC_1_ADDR         0xF6D7
#define REG_SPDIF_TX_UD_RIGHT_7_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_RIGHT_7_IC_1_VALUE        0x0

/* SPDIF_TX_UD_RIGHT_8  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_8_IC_1_ADDR         0xF6D8
#define REG_SPDIF_TX_UD_RIGHT_8_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_RIGHT_8_IC_1_VALUE        0x0

/* SPDIF_TX_UD_RIGHT_9  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_9_IC_1_ADDR         0xF6D9
#define REG_SPDIF_TX_UD_RIGHT_9_IC_1_BYTE         2
#define REG_SPDIF_TX_UD_RIGHT_9_IC_1_VALUE        0x0

/* SPDIF_TX_UD_RIGHT_10  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_10_IC_1_ADDR        0xF6DA
#define REG_SPDIF_TX_UD_RIGHT_10_IC_1_BYTE        2
#define REG_SPDIF_TX_UD_RIGHT_10_IC_1_VALUE       0x0

/* SPDIF_TX_UD_RIGHT_11  - Registers (IC 1) */
#define REG_SPDIF_TX_UD_RIGHT_11_IC_1_ADDR        0xF6DB
#define REG_SPDIF_TX_UD_RIGHT_11_IC_1_BYTE        2
#define REG_SPDIF_TX_UD_RIGHT_11_IC_1_VALUE       0x0

/* SPDIF_TX_VB_LEFT_0  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_0_IC_1_ADDR          0xF6E0
#define REG_SPDIF_TX_VB_LEFT_0_IC_1_BYTE          2
#define REG_SPDIF_TX_VB_LEFT_0_IC_1_VALUE         0x0

/* SPDIF_TX_VB_LEFT_1  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_1_IC_1_ADDR          0xF6E1
#define REG_SPDIF_TX_VB_LEFT_1_IC_1_BYTE          2
#define REG_SPDIF_TX_VB_LEFT_1_IC_1_VALUE         0x0

/* SPDIF_TX_VB_LEFT_2  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_2_IC_1_ADDR          0xF6E2
#define REG_SPDIF_TX_VB_LEFT_2_IC_1_BYTE          2
#define REG_SPDIF_TX_VB_LEFT_2_IC_1_VALUE         0x0

/* SPDIF_TX_VB_LEFT_3  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_3_IC_1_ADDR          0xF6E3
#define REG_SPDIF_TX_VB_LEFT_3_IC_1_BYTE          2
#define REG_SPDIF_TX_VB_LEFT_3_IC_1_VALUE         0x0

/* SPDIF_TX_VB_LEFT_4  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_4_IC_1_ADDR          0xF6E4
#define REG_SPDIF_TX_VB_LEFT_4_IC_1_BYTE          2
#define REG_SPDIF_TX_VB_LEFT_4_IC_1_VALUE         0x0

/* SPDIF_TX_VB_LEFT_5  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_5_IC_1_ADDR          0xF6E5
#define REG_SPDIF_TX_VB_LEFT_5_IC_1_BYTE          2
#define REG_SPDIF_TX_VB_LEFT_5_IC_1_VALUE         0x0

/* SPDIF_TX_VB_LEFT_6  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_6_IC_1_ADDR          0xF6E6
#define REG_SPDIF_TX_VB_LEFT_6_IC_1_BYTE          2
#define REG_SPDIF_TX_VB_LEFT_6_IC_1_VALUE         0x0

/* SPDIF_TX_VB_LEFT_7  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_7_IC_1_ADDR          0xF6E7
#define REG_SPDIF_TX_VB_LEFT_7_IC_1_BYTE          2
#define REG_SPDIF_TX_VB_LEFT_7_IC_1_VALUE         0x0

/* SPDIF_TX_VB_LEFT_8  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_8_IC_1_ADDR          0xF6E8
#define REG_SPDIF_TX_VB_LEFT_8_IC_1_BYTE          2
#define REG_SPDIF_TX_VB_LEFT_8_IC_1_VALUE         0x0

/* SPDIF_TX_VB_LEFT_9  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_9_IC_1_ADDR          0xF6E9
#define REG_SPDIF_TX_VB_LEFT_9_IC_1_BYTE          2
#define REG_SPDIF_TX_VB_LEFT_9_IC_1_VALUE         0x0

/* SPDIF_TX_VB_LEFT_10  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_10_IC_1_ADDR         0xF6EA
#define REG_SPDIF_TX_VB_LEFT_10_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_LEFT_10_IC_1_VALUE        0x0

/* SPDIF_TX_VB_LEFT_11  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_LEFT_11_IC_1_ADDR         0xF6EB
#define REG_SPDIF_TX_VB_LEFT_11_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_LEFT_11_IC_1_VALUE        0x0

/* SPDIF_TX_VB_RIGHT_0  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_0_IC_1_ADDR         0xF6F0
#define REG_SPDIF_TX_VB_RIGHT_0_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_RIGHT_0_IC_1_VALUE        0x0

/* SPDIF_TX_VB_RIGHT_1  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_1_IC_1_ADDR         0xF6F1
#define REG_SPDIF_TX_VB_RIGHT_1_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_RIGHT_1_IC_1_VALUE        0x0

/* SPDIF_TX_VB_RIGHT_2  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_2_IC_1_ADDR         0xF6F2
#define REG_SPDIF_TX_VB_RIGHT_2_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_RIGHT_2_IC_1_VALUE        0x0

/* SPDIF_TX_VB_RIGHT_3  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_3_IC_1_ADDR         0xF6F3
#define REG_SPDIF_TX_VB_RIGHT_3_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_RIGHT_3_IC_1_VALUE        0x0

/* SPDIF_TX_VB_RIGHT_4  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_4_IC_1_ADDR         0xF6F4
#define REG_SPDIF_TX_VB_RIGHT_4_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_RIGHT_4_IC_1_VALUE        0x0

/* SPDIF_TX_VB_RIGHT_5  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_5_IC_1_ADDR         0xF6F5
#define REG_SPDIF_TX_VB_RIGHT_5_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_RIGHT_5_IC_1_VALUE        0x0

/* SPDIF_TX_VB_RIGHT_6  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_6_IC_1_ADDR         0xF6F6
#define REG_SPDIF_TX_VB_RIGHT_6_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_RIGHT_6_IC_1_VALUE        0x0

/* SPDIF_TX_VB_RIGHT_7  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_7_IC_1_ADDR         0xF6F7
#define REG_SPDIF_TX_VB_RIGHT_7_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_RIGHT_7_IC_1_VALUE        0x0

/* SPDIF_TX_VB_RIGHT_8  - Registers (IC 1) */
#define REG_SPDIF_TX_VB_RIGHT_8_IC_1_ADDR         0xF6F8
#define REG_SPDIF_TX_VB_RIGHT_8_IC_1_BYTE         2
#define REG_SPDIF_TX_VB_RIGHT_8_IC_1_VALUE        0x0

