mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* BCLK_IN3_PIN  - Registers (IC 1) */
#define REG_BCLK_IN3_PIN_IC_1_ADDR                0xF783
#define REG_BCLK_IN3_PIN_IC_1_BYTE                2
#define REG_BCLK_IN3_PIN_IC_1_VALUE               0x18

/* BCLK_OUT0_PIN  - Registers (IC 1) */
#define REG_BCLK_OUT0_PIN_IC_1_ADDR               0xF784
#define REG_BCLK_OUT0_PIN_IC_1_BYTE               2
#define REG_BCLK_OUT0_PIN_IC_1_VALUE              0x18

/* BCLK_OUT1_PIN  - Registers (IC 1) */
#define REG_BCLK_OUT1_PIN_IC_1_ADDR               0xF785
#define REG_BCLK_OUT1_PIN_IC_1_BYTE               2
#define REG_BCLK_OUT1_PIN_IC_1_VALUE              0x18

/* BCLK_OUT2_PIN  - Registers (IC 1) */
#define REG_BCLK_OUT2_PIN_IC_1_ADDR               0xF786
#define REG_BCLK_OUT2_PIN_IC_1_BYTE               2
#define REG_BCLK_OUT2_PIN_IC_1_VALUE              0x18

/* BCLK_OUT3_PIN  - Registers (IC 1) */
#define REG_BCLK_OUT3_PIN_IC_1_ADDR               0xF787
#define REG_BCLK_OUT3_PIN_IC_1_BYTE               2
#define REG_BCLK_OUT3_PIN_IC_1_VALUE              0x18

/* LRCLK_IN0_PIN  - Registers (IC 1) */
#define REG_LRCLK_IN0_PIN_IC_1_ADDR               0xF788
#define REG_LRCLK_IN0_PIN_IC_1_BYTE               2
#define REG_LRCLK_IN0_PIN_IC_1_VALUE              0x18

/* LRCLK_IN1_PIN  - Registers (IC 1) */
#define REG_LRCLK_IN1_PIN_IC_1_ADDR               0xF789
#define REG_LRCLK_IN1_PIN_IC_1_BYTE               2
#define REG_LRCLK_IN1_PIN_IC_1_VALUE              0x18

/* LRCLK_IN2_PIN  - Registers (IC 1) */
#define REG_LRCLK_IN2_PIN_IC_1_ADDR               0xF78A
#define REG_LRCLK_IN2_PIN_IC_1_BYTE               2
#define REG_LRCLK_IN2_PIN_IC_1_VALUE              0x18

/* LRCLK_IN3_PIN  - Registers (IC 1) */
#define REG_LRCLK_IN3_PIN_IC_1_ADDR               0xF78B
#define REG_LRCLK_IN3_PIN_IC_1_BYTE               2
#define REG_LRCLK_IN3_PIN_IC_1_VALUE              0x18

/* LRCLK_OUT0_PIN  - Registers (IC 1) */
#define REG_LRCLK_OUT0_PIN_IC_1_ADDR              0xF78C
#define REG_LRCLK_OUT0_PIN_IC_1_BYTE              2
#define REG_LRCLK_OUT0_PIN_IC_1_VALUE             0x18

/* LRCLK_OUT1_PIN  - Registers (IC 1) */
#define REG_LRCLK_OUT1_PIN_IC_1_ADDR              0xF78D
#define REG_LRCLK_OUT1_PIN_IC_1_BYTE              2
#define REG_LRCLK_OUT1_PIN_IC_1_VALUE             0x18

/* LRCLK_OUT2_PIN  - Registers (IC 1) */
#define REG_LRCLK_OUT2_PIN_IC_1_ADDR              0xF78E
#define REG_LRCLK_OUT2_PIN_IC_1_BYTE              2
#define REG_LRCLK_OUT2_PIN_IC_1_VALUE             0x18

/* LRCLK_OUT3_PIN  - Registers (IC 1) */
#define REG_LRCLK_OUT3_PIN_IC_1_ADDR              0xF78F
#define REG_LRCLK_OUT3_PIN_IC_1_BYTE              2
#define REG_LRCLK_OUT3_PIN_IC_1_VALUE             0x18

/* SDATA_IN0_PIN  - Registers (IC 1) */
#define REG_SDATA_IN0_PIN_IC_1_ADDR               0xF790
#define REG_SDATA_IN0_PIN_IC_1_BYTE               2
#define REG_SDATA_IN0_PIN_IC_1_VALUE              0x18

/* SDATA_IN1_PIN  - Registers (IC 1) */
#define REG_SDATA_IN1_PIN_IC_1_ADDR               0xF791
#define REG_SDATA_IN1_PIN_IC_1_BYTE               2
#define REG_SDATA_IN1_PIN_IC_1_VALUE              0x18

/* SDATA_IN2_PIN  - Registers (IC 1) */
#define REG_SDATA_IN2_PIN_IC_1_ADDR               0xF792
#define REG_SDATA_IN2_PIN_IC_1_BYTE               2
#define REG_SDATA_IN2_PIN_IC_1_VALUE              0x18

/* SDATA_IN3_PIN  - Registers (IC 1) */
#define REG_SDATA_IN3_PIN_IC_1_ADDR               0xF793
#define REG_SDATA_IN3_PIN_IC_1_BYTE               2
#define REG_SDATA_IN3_PIN_IC_1_VALUE              0x18

/* SDATA_OUT0_PIN  - Registers (IC 1) */
#define REG_SDATA_OUT0_PIN_IC_1_ADDR              0xF794
#define REG_SDATA_OUT0_PIN_IC_1_BYTE              2
#define REG_SDATA_OUT0_PIN_IC_1_VALUE             0x8

/* SDATA_OUT1_PIN  - Registers (IC 1) */
#define REG_SDATA_OUT1_PIN_IC_1_ADDR              0xF795
#define REG_SDATA_OUT1_PIN_IC_1_BYTE              2
#define REG_SDATA_OUT1_PIN_IC_1_VALUE             0x8

/* SDATA_OUT2_PIN  - Registers (IC 1) */
#define REG_SDATA_OUT2_PIN_IC_1_ADDR              0xF796
#define REG_SDATA_OUT2_PIN_IC_1_BYTE              2
#define REG_SDATA_OUT2_PIN_IC_1_VALUE             0x8

/* SDATA_OUT3_PIN  - Registers (IC 1) */
#define REG_SDATA_OUT3_PIN_IC_1_ADDR              0xF797
#define REG_SDATA_OUT3_PIN_IC_1_BYTE              2
#define REG_SDATA_OUT3_PIN_IC_1_VALUE             0x8

/* SPDIF_TX_PIN  - Registers (IC 1) */
#define REG_SPDIF_TX_PIN_IC_1_ADDR                0xF798
#define REG_SPDIF_TX_PIN_IC_1_BYTE                2
#define REG_SPDIF_TX_PIN_IC_1_VALUE               0x8

/* SCLK_SCL_PIN  - Registers (IC 1) */
#define REG_SCLK_SCL_PIN_IC_1_ADDR                0xF799
#define REG_SCLK_SCL_PIN_IC_1_BYTE                2
#define REG_SCLK_SCL_PIN_IC_1_VALUE               0x8

/* MISO_SDA_PIN  - Registers (IC 1) */
#define REG_MISO_SDA_PIN_IC_1_ADDR                0xF79A
#define REG_MISO_SDA_PIN_IC_1_BYTE                2
#define REG_MISO_SDA_PIN_IC_1_VALUE               0x8

/* SS_PIN  - Registers (IC 1) */
#define REG_SS_PIN_IC_1_ADDR                      0xF79B
#define REG_SS_PIN_IC_1_BYTE                      2
#define REG_SS_PIN_IC_1_VALUE                     0x18

/* MOSI_ADDR1_PIN  - Registers (IC 1) */
#define REG_MOSI_ADDR1_PIN_IC_1_ADDR              0xF79C
#define REG_MOSI_ADDR1_PIN_IC_1_BYTE              2
#define REG_MOSI_ADDR1_PIN_IC_1_VALUE             0x18

/* SCLK_SCL_M_PIN  - Registers (IC 1) */
#define REG_SCLK_SCL_M_PIN_IC_1_ADDR              0xF79D
#define REG_SCLK_SCL_M_PIN_IC_1_BYTE              2
#define REG_SCLK_SCL_M_PIN_IC_1_VALUE             0x8

/* MISO_SDA_M_PIN  - Registers (IC 1) */
#define REG_MISO_SDA_M_PIN_IC_1_ADDR              0xF79E
#define REG_MISO_SDA_M_PIN_IC_1_BYTE              2
#define REG_MISO_SDA_M_PIN_IC_1_VALUE             0x8

/* SS_M_PIN  - Registers (IC 1) */
#define REG_SS_M_PIN_IC_1_ADDR                    0xF79F
#define REG_SS_M_PIN_IC_1_BYTE                    2
#define REG_SS_M_PIN_IC_1_VALUE                   0x18

/* MOSI_M_PIN  - Registers (IC 1) */
#define REG_MOSI_M_PIN_IC_1_ADDR                  0xF7A0
#define REG_MOSI_M_PIN_IC_1_BYTE                  2
#define REG_MOSI_M_PIN_IC_1_VALUE                 0x18

/* MP6_PIN  - Registers (IC 1) */
#define REG_MP6_PIN_IC_1_ADDR                     0xF7A1
#define REG_MP6_PIN_IC_1_BYTE                     2
#define REG_MP6_PIN_IC_1_VALUE                    0x18

/* MP7_PIN  - Registers (IC 1) */
#define REG_MP7_PIN_IC_1_ADDR                     0xF7A2
#define REG_MP7_PIN_IC_1_BYTE                     2
#define REG_MP7_PIN_IC_1_VALUE                    0x18

