mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* ASRC_INPUT0 (IC 1) */
#define R17_ASRC_INPUT0_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R17_ASRC_INPUT0_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R17_ASRC_INPUT0_ASRC_SOURCE_IC_1_MASK     0x7
#define R17_ASRC_INPUT0_ASRC_SOURCE_IC_1_SHIFT    0
#define R17_ASRC_INPUT0_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R17_ASRC_INPUT0_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT1 (IC 1) */
#define R18_ASRC_INPUT1_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R18_ASRC_INPUT1_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R18_ASRC_INPUT1_ASRC_SOURCE_IC_1_MASK     0x7
#define R18_ASRC_INPUT1_ASRC_SOURCE_IC_1_SHIFT    0
#define R18_ASRC_INPUT1_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R18_ASRC_INPUT1_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT2 (IC 1) */
#define R19_ASRC_INPUT2_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R19_ASRC_INPUT2_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R19_ASRC_INPUT2_ASRC_SOURCE_IC_1_MASK     0x7
#define R19_ASRC_INPUT2_ASRC_SOURCE_IC_1_SHIFT    0
#define R19_ASRC_INPUT2_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R19_ASRC_INPUT2_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT3 (IC 1) */
#define R20_ASRC_INPUT3_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R20_ASRC_INPUT3_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R20_ASRC_INPUT3_ASRC_SOURCE_IC_1_MASK     0x7
#define R20_ASRC_INPUT3_ASRC_SOURCE_IC_1_SHIFT    0
#define R20_ASRC_INPUT3_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R20_ASRC_INPUT3_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT4 (IC 1) */
#define R21_ASRC_INPUT4_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R21_ASRC_INPUT4_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R21_ASRC_INPUT4_ASRC_SOURCE_IC_1_MASK     0x7
#define R21_ASRC_INPUT4_ASRC_SOURCE_IC_1_SHIFT    0
#define R21_ASRC_INPUT4_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R21_ASRC_INPUT4_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT5 (IC 1) */
#define R22_ASRC_INPUT5_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R22_ASRC_INPUT5_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R22_ASRC_INPUT5_ASRC_SOURCE_IC_1_MASK     0x7
#define R22_ASRC_INPUT5_ASRC_SOURCE_IC_1_SHIFT    0
#define R22_ASRC_INPUT5_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R22_ASRC_INPUT5_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT6 (IC 1) */
#define R23_ASRC_INPUT6_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R23_ASRC_INPUT6_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R23_ASRC_INPUT6_ASRC_SOURCE_IC_1_MASK     0x7
#define R23_ASRC_INPUT6_ASRC_SOURCE_IC_1_SHIFT    0
#define R23_ASRC_INPUT6_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R23_ASRC_INPUT6_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_INPUT7 (IC 1) */
#define R24_ASRC_INPUT7_ASRC_SOURCE_IC_1          0x0    /* 000b	[2:0] */
#define R24_ASRC_INPUT7_ASRC_SIN_CHANNEL_IC_1     0x0    /* 00000b	[7:3] */
#define R24_ASRC_INPUT7_ASRC_SOURCE_IC_1_MASK     0x7
#define R24_ASRC_INPUT7_ASRC_SOURCE_IC_1_SHIFT    0
#define R24_ASRC_INPUT7_ASRC_SIN_CHANNEL_IC_1_MASK 0xF8
#define R24_ASRC_INPUT7_ASRC_SIN_CHANNEL_IC_1_SHIFT 3

/* ASRC_OUT_RATE0 (IC 1) */
#define R25_ASRC_OUT_RATE0_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R25_ASRC_OUT_RATE0_ASRC_RATE_IC_1_MASK    0xF
#define R25_ASRC_OUT_RATE0_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE1 (IC 1) */
#define R26_ASRC_OUT_RATE1_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R26_ASRC_OUT_RATE1_ASRC_RATE_IC_1_MASK    0xF
#define R26_ASRC_OUT_RATE1_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE2 (IC 1) */
#define R27_ASRC_OUT_RATE2_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R27_ASRC_OUT_RATE2_ASRC_RATE_IC_1_MASK    0xF
#define R27_ASRC_OUT_RATE2_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE3 (IC 1) */
#define R28_ASRC_OUT_RATE3_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R28_ASRC_OUT_RATE3_ASRC_RATE_IC_1_MASK    0xF
#define R28_ASRC_OUT_RATE3_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE4 (IC 1) */
#define R29_ASRC_OUT_RATE4_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R29_ASRC_OUT_RATE4_ASRC_RATE_IC_1_MASK    0xF
#define R29_ASRC_OUT_RATE4_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE5 (IC 1) */
#define R30_ASRC_OUT_RATE5_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R30_ASRC_OUT_RATE5_ASRC_RATE_IC_1_MASK    0xF
#define R30_ASRC_OUT_RATE5_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE6 (IC 1) */
#define R31_ASRC_OUT_RATE6_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R31_ASRC_OUT_RATE6_ASRC_RATE_IC_1_MASK    0xF
#define R31_ASRC_OUT_RATE6_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE7 (IC 1) */
#define R32_ASRC_OUT_RATE7_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R32_ASRC_OUT_RATE7_ASRC_RATE_IC_1_MASK    0xF
#define R32_ASRC_OUT_RATE7_ASRC_RATE_IC_1_SHIFT   0

/* SOUT_SOURCE0 (IC 1) */
#define R33_SOUT_SOURCE0_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R33_SOUT_SOURCE0_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R33_SOUT_SOURCE0_SOUT_SOURCE_IC_1_MASK    0x7
#define R33_SOUT_SOURCE0_SOUT_SOURCE_IC_1_SHIFT   0
#define R33_SOUT_SOURCE0_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R33_SOUT_SOURCE0_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE1 (IC 1) */
#define R34_SOUT_SOURCE1_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R34_SOUT_SOURCE1_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R34_SOUT_SOURCE1_SOUT_SOURCE_IC_1_MASK    0x7
#define R34_SOUT_SOURCE1_SOUT_SOURCE_IC_1_SHIFT   0
#define R34_SOUT_SOURCE1_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R34_SOUT_SOURCE1_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE2 (IC 1) */
#define R35_SOUT_SOURCE2_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R35_SOUT_SOURCE2_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R35_SOUT_SOURCE2_SOUT_SOURCE_IC_1_MASK    0x7
#define R35_SOUT_SOURCE2_SOUT_SOURCE_IC_1_SHIFT   0
#define R35_SOUT_SOURCE2_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R35_SOUT_SOURCE2_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE3 (IC 1) */
#define R36_SOUT_SOURCE3_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R36_SOUT_SOURCE3_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R36_SOUT_SOURCE3_SOUT_SOURCE_IC_1_MASK    0x7
#define R36_SOUT_SOURCE3_SOUT_SOURCE_IC_1_SHIFT   0
#define R36_SOUT_SOURCE3_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R36_SOUT_SOURCE3_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE4 (IC 1) */
#define R37_SOUT_SOURCE4_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R37_SOUT_SOURCE4_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R37_SOUT_SOURCE4_SOUT_SOURCE_IC_1_MASK    0x7
#define R37_SOUT_SOURCE4_SOUT_SOURCE_IC_1_SHIFT   0
#define R37_SOUT_SOURCE4_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R37_SOUT_SOURCE4_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE5 (IC 1) */
#define R38_SOUT_SOURCE5_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R38_SOUT_SOURCE5_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R38_SOUT_SOURCE5_SOUT_SOURCE_IC_1_MASK    0x7
#define R38_SOUT_SOURCE5_SOUT_SOURCE_IC_1_SHIFT   0
#define R38_SOUT_SOURCE5_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R38_SOUT_SOURCE5_SOUT_ASRC_SELECT_IC_1_SHIFT 3

