mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* FTDM_OUT52 (IC 1) */
#define R190_FTDM_OUT52_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R190_FTDM_OUT52_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R190_FTDM_OUT52_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R190_FTDM_OUT52_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R190_FTDM_OUT52_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R190_FTDM_OUT52_BYTE_OUT_POS_IC_1_MASK    0x3
#define R190_FTDM_OUT52_BYTE_OUT_POS_IC_1_SHIFT   0
#define R190_FTDM_OUT52_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R190_FTDM_OUT52_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R190_FTDM_OUT52_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R190_FTDM_OUT52_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R190_FTDM_OUT52_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R190_FTDM_OUT52_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R190_FTDM_OUT52_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R190_FTDM_OUT52_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT53 (IC 1) */
#define R191_FTDM_OUT53_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R191_FTDM_OUT53_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R191_FTDM_OUT53_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R191_FTDM_OUT53_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R191_FTDM_OUT53_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R191_FTDM_OUT53_BYTE_OUT_POS_IC_1_MASK    0x3
#define R191_FTDM_OUT53_BYTE_OUT_POS_IC_1_SHIFT   0
#define R191_FTDM_OUT53_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R191_FTDM_OUT53_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R191_FTDM_OUT53_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R191_FTDM_OUT53_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R191_FTDM_OUT53_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R191_FTDM_OUT53_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R191_FTDM_OUT53_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R191_FTDM_OUT53_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT54 (IC 1) */
#define R192_FTDM_OUT54_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R192_FTDM_OUT54_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R192_FTDM_OUT54_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R192_FTDM_OUT54_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R192_FTDM_OUT54_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R192_FTDM_OUT54_BYTE_OUT_POS_IC_1_MASK    0x3
#define R192_FTDM_OUT54_BYTE_OUT_POS_IC_1_SHIFT   0
#define R192_FTDM_OUT54_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R192_FTDM_OUT54_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R192_FTDM_OUT54_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R192_FTDM_OUT54_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R192_FTDM_OUT54_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R192_FTDM_OUT54_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R192_FTDM_OUT54_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R192_FTDM_OUT54_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT55 (IC 1) */
#define R193_FTDM_OUT55_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R193_FTDM_OUT55_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R193_FTDM_OUT55_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R193_FTDM_OUT55_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R193_FTDM_OUT55_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R193_FTDM_OUT55_BYTE_OUT_POS_IC_1_MASK    0x3
#define R193_FTDM_OUT55_BYTE_OUT_POS_IC_1_SHIFT   0
#define R193_FTDM_OUT55_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R193_FTDM_OUT55_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R193_FTDM_OUT55_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R193_FTDM_OUT55_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R193_FTDM_OUT55_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R193_FTDM_OUT55_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R193_FTDM_OUT55_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R193_FTDM_OUT55_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT56 (IC 1) */
#define R194_FTDM_OUT56_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R194_FTDM_OUT56_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R194_FTDM_OUT56_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R194_FTDM_OUT56_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R194_FTDM_OUT56_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R194_FTDM_OUT56_BYTE_OUT_POS_IC_1_MASK    0x3
#define R194_FTDM_OUT56_BYTE_OUT_POS_IC_1_SHIFT   0
#define R194_FTDM_OUT56_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R194_FTDM_OUT56_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R194_FTDM_OUT56_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R194_FTDM_OUT56_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R194_FTDM_OUT56_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R194_FTDM_OUT56_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R194_FTDM_OUT56_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R194_FTDM_OUT56_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT57 (IC 1) */
#define R195_FTDM_OUT57_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R195_FTDM_OUT57_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R195_FTDM_OUT57_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R195_FTDM_OUT57_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R195_FTDM_OUT57_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R195_FTDM_OUT57_BYTE_OUT_POS_IC_1_MASK    0x3
#define R195_FTDM_OUT57_BYTE_OUT_POS_IC_1_SHIFT   0
#define R195_FTDM_OUT57_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R195_FTDM_OUT57_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R195_FTDM_OUT57_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R195_FTDM_OUT57_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R195_FTDM_OUT57_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R195_FTDM_OUT57_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R195_FTDM_OUT57_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R195_FTDM_OUT57_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT58 (IC 1) */
#define R196_FTDM_OUT58_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R196_FTDM_OUT58_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R196_FTDM_OUT58_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R196_FTDM_OUT58_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R196_FTDM_OUT58_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R196_FTDM_OUT58_BYTE_OUT_POS_IC_1_MASK    0x3
#define R196_FTDM_OUT58_BYTE_OUT_POS_IC_1_SHIFT   0
#define R196_FTDM_OUT58_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R196_FTDM_OUT58_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R196_FTDM_OUT58_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R196_FTDM_OUT58_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R196_FTDM_OUT58_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R196_FTDM_OUT58_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R196_FTDM_OUT58_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R196_FTDM_OUT58_SLOT_ENABLE_OUT_IC_1_SHIFT 7

