mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* PANIC_CODE2 (IC 1) */
#define R234_PANIC_CODE2_ERR_DM0B2SB0_IC_1        0x0    /* 0b	[0] */
#define R234_PANIC_CODE2_ERR_DM0B2SB1_IC_1        0x0    /* 0b	[1] */
#define R234_PANIC_CODE2_ERR_DM0B2SB2_IC_1        0x0    /* 0b	[2] */
#define R234_PANIC_CODE2_ERR_DM0B2SB3_IC_1        0x0    /* 0b	[3] */
#define R234_PANIC_CODE2_ERR_DM0B2SB4_IC_1        0x0    /* 0b	[4] */
#define R234_PANIC_CODE2_ERR_DM0B3SB0_IC_1        0x0    /* 0b	[8] */
#define R234_PANIC_CODE2_ERR_DM0B3SB1_IC_1        0x0    /* 0b	[9] */
#define R234_PANIC_CODE2_ERR_DM0B3SB2_IC_1        0x0    /* 0b	[10] */
#define R234_PANIC_CODE2_ERR_DM0B3SB3_IC_1        0x0    /* 0b	[11] */
#define R234_PANIC_CODE2_ERR_DM0B3SB4_IC_1        0x0    /* 0b	[12] */
#define R234_PANIC_CODE2_ERR_DM0B2SB0_IC_1_MASK   0x1
#define R234_PANIC_CODE2_ERR_DM0B2SB0_IC_1_SHIFT  0
#define R234_PANIC_CODE2_ERR_DM0B2SB1_IC_1_MASK   0x2
#define R234_PANIC_CODE2_ERR_DM0B2SB1_IC_1_SHIFT  1
#define R234_PANIC_CODE2_ERR_DM0B2SB2_IC_1_MASK   0x4
#define R234_PANIC_CODE2_ERR_DM0B2SB2_IC_1_SHIFT  2
#define R234_PANIC_CODE2_ERR_DM0B2SB3_IC_1_MASK   0x8
#define R234_PANIC_CODE2_ERR_DM0B2SB3_IC_1_SHIFT  3
#define R234_PANIC_CODE2_ERR_DM0B2SB4_IC_1_MASK   0x10
#define R234_PANIC_CODE2_ERR_DM0B2SB4_IC_1_SHIFT  4
#define R234_PANIC_CODE2_ERR_DM0B3SB0_IC_1_MASK   0x100
#define R234_PANIC_CODE2_ERR_DM0B3SB0_IC_1_SHIFT  8
#define R234_PANIC_CODE2_ERR_DM0B3SB1_IC_1_MASK   0x200
#define R234_PANIC_CODE2_ERR_DM0B3SB1_IC_1_SHIFT  9
#define R234_PANIC_CODE2_ERR_DM0B3SB2_IC_1_MASK   0x400
#define R234_PANIC_CODE2_ERR_DM0B3SB2_IC_1_SHIFT  10
#define R234_PANIC_CODE2_ERR_DM0B3SB3_IC_1_MASK   0x800
#define R234_PANIC_CODE2_ERR_DM0B3SB3_IC_1_SHIFT  11
#define R234_PANIC_CODE2_ERR_DM0B3SB4_IC_1_MASK   0x1000
#define R234_PANIC_CODE2_ERR_DM0B3SB4_IC_1_SHIFT  12

/* PANIC_CODE3 (IC 1) */
#define R235_PANIC_CODE3_ERR_DM1B0SB0_IC_1        0x0    /* 0b	[0] */
#define R235_PANIC_CODE3_ERR_DM1B0SB1_IC_1        0x0    /* 0b	[1] */
#define R235_PANIC_CODE3_ERR_DM1B0SB2_IC_1        0x0    /* 0b	[2] */
#define R235_PANIC_CODE3_ERR_DM1B0SB3_IC_1        0x0    /* 0b	[3] */
#define R235_PANIC_CODE3_ERR_DM1B0SB4_IC_1        0x0    /* 0b	[4] */
#define R235_PANIC_CODE3_ERR_DM1B1SB0_IC_1        0x0    /* 0b	[8] */
#define R235_PANIC_CODE3_ERR_DM1B1SB1_IC_1        0x0    /* 0b	[9] */
#define R235_PANIC_CODE3_ERR_DM1B1SB2_IC_1        0x0    /* 0b	[10] */
#define R235_PANIC_CODE3_ERR_DM1B1SB3_IC_1        0x0    /* 0b	[11] */
#define R235_PANIC_CODE3_ERR_DM1B1SB4_IC_1        0x0    /* 0b	[12] */
#define R235_PANIC_CODE3_ERR_DM1B0SB0_IC_1_MASK   0x1
#define R235_PANIC_CODE3_ERR_DM1B0SB0_IC_1_SHIFT  0
#define R235_PANIC_CODE3_ERR_DM1B0SB1_IC_1_MASK   0x2
#define R235_PANIC_CODE3_ERR_DM1B0SB1_IC_1_SHIFT  1
#define R235_PANIC_CODE3_ERR_DM1B0SB2_IC_1_MASK   0x4
#define R235_PANIC_CODE3_ERR_DM1B0SB2_IC_1_SHIFT  2
#define R235_PANIC_CODE3_ERR_DM1B0SB3_IC_1_MASK   0x8
#define R235_PANIC_CODE3_ERR_DM1B0SB3_IC_1_SHIFT  3
#define R235_PANIC_CODE3_ERR_DM1B0SB4_IC_1_MASK   0x10
#define R235_PANIC_CODE3_ERR_DM1B0SB4_IC_1_SHIFT  4
#define R235_PANIC_CODE3_ERR_DM1B1SB0_IC_1_MASK   0x100
#define R235_PANIC_CODE3_ERR_DM1B1SB0_IC_1_SHIFT  8
#define R235_PANIC_CODE3_ERR_DM1B1SB1_IC_1_MASK   0x200
#define R235_PANIC_CODE3_ERR_DM1B1SB1_IC_1_SHIFT  9
#define R235_PANIC_CODE3_ERR_DM1B1SB2_IC_1_MASK   0x400
#define R235_PANIC_CODE3_ERR_DM1B1SB2_IC_1_SHIFT  10
#define R235_PANIC_CODE3_ERR_DM1B1SB3_IC_1_MASK   0x800
#define R235_PANIC_CODE3_ERR_DM1B1SB3_IC_1_SHIFT  11
#define R235_PANIC_CODE3_ERR_DM1B1SB4_IC_1_MASK   0x1000
#define R235_PANIC_CODE3_ERR_DM1B1SB4_IC_1_SHIFT  12

/* PANIC_CODE4 (IC 1) */
#define R236_PANIC_CODE4_ERR_DM1B2SB0_IC_1        0x0    /* 0b	[0] */
#define R236_PANIC_CODE4_ERR_DM1B2SB1_IC_1        0x0    /* 0b	[1] */
#define R236_PANIC_CODE4_ERR_DM1B2SB2_IC_1        0x0    /* 0b	[2] */
#define R236_PANIC_CODE4_ERR_DM1B2SB3_IC_1        0x0    /* 0b	[3] */
#define R236_PANIC_CODE4_ERR_DM1B2SB4_IC_1        0x0    /* 0b	[4] */
#define R236_PANIC_CODE4_ERR_DM1B3SB0_IC_1        0x0    /* 0b	[8] */
#define R236_PANIC_CODE4_ERR_DM1B3SB1_IC_1        0x0    /* 0b	[9] */
#define R236_PANIC_CODE4_ERR_DM1B3SB2_IC_1        0x0    /* 0b	[10] */
#define R236_PANIC_CODE4_ERR_DM1B3SB3_IC_1        0x0    /* 0b	[11] */
#define R236_PANIC_CODE4_ERR_DM1B3SB4_IC_1        0x0    /* 0b	[12] */
#define R236_PANIC_CODE4_ERR_DM1B2SB0_IC_1_MASK   0x1
#define R236_PANIC_CODE4_ERR_DM1B2SB0_IC_1_SHIFT  0
#define R236_PANIC_CODE4_ERR_DM1B2SB1_IC_1_MASK   0x2
#define R236_PANIC_CODE4_ERR_DM1B2SB1_IC_1_SHIFT  1
#define R236_PANIC_CODE4_ERR_DM1B2SB2_IC_1_MASK   0x4
#define R236_PANIC_CODE4_ERR_DM1B2SB2_IC_1_SHIFT  2
#define R236_PANIC_CODE4_ERR_DM1B2SB3_IC_1_MASK   0x8
#define R236_PANIC_CODE4_ERR_DM1B2SB3_IC_1_SHIFT  3
#define R236_PANIC_CODE4_ERR_DM1B2SB4_IC_1_MASK   0x10
#define R236_PANIC_CODE4_ERR_DM1B2SB4_IC_1_SHIFT  4
#define R236_PANIC_CODE4_ERR_DM1B3SB0_IC_1_MASK   0x100
#define R236_PANIC_CODE4_ERR_DM1B3SB0_IC_1_SHIFT  8
#define R236_PANIC_CODE4_ERR_DM1B3SB1_IC_1_MASK   0x200
#define R236_PANIC_CODE4_ERR_DM1B3SB1_IC_1_SHIFT  9
#define R236_PANIC_CODE4_ERR_DM1B3SB2_IC_1_MASK   0x400
#define R236_PANIC_CODE4_ERR_DM1B3SB2_IC_1_SHIFT  10
#define R236_PANIC_CODE4_ERR_DM1B3SB3_IC_1_MASK   0x800
#define R236_PANIC_CODE4_ERR_DM1B3SB3_IC_1_SHIFT  11
#define R236_PANIC_CODE4_ERR_DM1B3SB4_IC_1_MASK   0x1000
#define R236_PANIC_CODE4_ERR_DM1B3SB4_IC_1_SHIFT  12

/* PANIC_CODE5 (IC 1) */
#define R237_PANIC_CODE5_ERR_PM_B0SB0_IC_1        0x0    /* 0b	[0] */
#define R237_PANIC_CODE5_ERR_PM_B0SB1_IC_1        0x0    /* 0b	[1] */
#define R237_PANIC_CODE5_ERR_PM_B0SB2_IC_1        0x0    /* 0b	[2] */
#define R237_PANIC_CODE5_ERR_PM_B0SB3_IC_1        0x0    /* 0b	[3] */
#define R237_PANIC_CODE5_ERR_PM_B0SB4_IC_1        0x0    /* 0b	[4] */
#define R237_PANIC_CODE5_ERR_PM_B0SB5_IC_1        0x0    /* 0b	[5] */
#define R237_PANIC_CODE5_ERR_PM_B1SB0_IC_1        0x0    /* 0b	[8] */
#define R237_PANIC_CODE5_ERR_PM_B1SB1_IC_1        0x0    /* 0b	[9] */
#define R237_PANIC_CODE5_ERR_PM_B1SB2_IC_1        0x0    /* 0b	[10] */
#define R237_PANIC_CODE5_ERR_PM_B1SB3_IC_1        0x0    /* 0b	[11] */
#define R237_PANIC_CODE5_ERR_PM_B1SB4_IC_1        0x0    /* 0b	[12] */
#define R237_PANIC_CODE5_ERR_PM_B1SB5_IC_1        0x0    /* 0b	[13] */
#define R237_PANIC_CODE5_ERR_PM_B0SB0_IC_1_MASK   0x1
#define R237_PANIC_CODE5_ERR_PM_B0SB0_IC_1_SHIFT  0
#define R237_PANIC_CODE5_ERR_PM_B0SB1_IC_1_MASK   0x2
#define R237_PANIC_CODE5_ERR_PM_B0SB1_IC_1_SHIFT  1
#define R237_PANIC_CODE5_ERR_PM_B0SB2_IC_1_MASK   0x4
#define R237_PANIC_CODE5_ERR_PM_B0SB2_IC_1_SHIFT  2
#define R237_PANIC_CODE5_ERR_PM_B0SB3_IC_1_MASK   0x8
#define R237_PANIC_CODE5_ERR_PM_B0SB3_IC_1_SHIFT  3
#define R237_PANIC_CODE5_ERR_PM_B0SB4_IC_1_MASK   0x10
#define R237_PANIC_CODE5_ERR_PM_B0SB4_IC_1_SHIFT  4
#define R237_PANIC_CODE5_ERR_PM_B0SB5_IC_1_MASK   0x20
#define R237_PANIC_CODE5_ERR_PM_B0SB5_IC_1_SHIFT  5
#define R237_PANIC_CODE5_ERR_PM_B1SB0_IC_1_MASK   0x100
#define R237_PANIC_CODE5_ERR_PM_B1SB0_IC_1_SHIFT  8
#define R237_PANIC_CODE5_ERR_PM_B1SB1_IC_1_MASK   0x200
#define R237_PANIC_CODE5_ERR_PM_B1SB1_IC_1_SHIFT  9
#define R237_PANIC_CODE5_ERR_PM_B1SB2_IC_1_MASK   0x400
#define R237_PANIC_CODE5_ERR_PM_B1SB2_IC_1_SHIFT  10
#define R237_PANIC_CODE5_ERR_PM_B1SB3_IC_1_MASK   0x800
#define R237_PANIC_CODE5_ERR_PM_B1SB3_IC_1_SHIFT  11
#define R237_PANIC_CODE5_ERR_PM_B1SB4_IC_1_MASK   0x1000
#define R237_PANIC_CODE5_ERR_PM_B1SB4_IC_1_SHIFT  12
#define R237_PANIC_CODE5_ERR_PM_B1SB5_IC_1_MASK   0x2000
#define R237_PANIC_CODE5_ERR_PM_B1SB5_IC_1_SHIFT  13

