mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* MP0_MODE (IC 1) */
#define R238_MP0_MODE_MP_ENABLE_IC_1              0x1    /* 1b	[0] */
#define R238_MP0_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R238_MP0_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R238_MP0_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R238_MP0_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R238_MP0_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R238_MP0_MODE_MP_MODE_IC_1_MASK           0xE
#define R238_MP0_MODE_MP_MODE_IC_1_SHIFT          1
#define R238_MP0_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R238_MP0_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R238_MP0_MODE_SS_SELECT_IC_1_MASK         0x700
#define R238_MP0_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP1_MODE (IC 1) */
#define R239_MP1_MODE_MP_ENABLE_IC_1              0x1    /* 1b	[0] */
#define R239_MP1_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R239_MP1_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R239_MP1_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R239_MP1_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R239_MP1_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R239_MP1_MODE_MP_MODE_IC_1_MASK           0xE
#define R239_MP1_MODE_MP_MODE_IC_1_SHIFT          1
#define R239_MP1_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R239_MP1_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R239_MP1_MODE_SS_SELECT_IC_1_MASK         0x700
#define R239_MP1_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP2_MODE (IC 1) */
#define R240_MP2_MODE_MP_ENABLE_IC_1              0x1    /* 1b	[0] */
#define R240_MP2_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R240_MP2_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R240_MP2_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R240_MP2_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R240_MP2_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R240_MP2_MODE_MP_MODE_IC_1_MASK           0xE
#define R240_MP2_MODE_MP_MODE_IC_1_SHIFT          1
#define R240_MP2_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R240_MP2_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R240_MP2_MODE_SS_SELECT_IC_1_MASK         0x700
#define R240_MP2_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP3_MODE (IC 1) */
#define R241_MP3_MODE_MP_ENABLE_IC_1              0x1    /* 1b	[0] */
#define R241_MP3_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R241_MP3_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R241_MP3_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R241_MP3_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R241_MP3_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R241_MP3_MODE_MP_MODE_IC_1_MASK           0xE
#define R241_MP3_MODE_MP_MODE_IC_1_SHIFT          1
#define R241_MP3_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R241_MP3_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R241_MP3_MODE_SS_SELECT_IC_1_MASK         0x700
#define R241_MP3_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP4_MODE (IC 1) */
#define R242_MP4_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R242_MP4_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R242_MP4_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R242_MP4_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R242_MP4_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R242_MP4_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R242_MP4_MODE_MP_MODE_IC_1_MASK           0xE
#define R242_MP4_MODE_MP_MODE_IC_1_SHIFT          1
#define R242_MP4_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R242_MP4_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R242_MP4_MODE_SS_SELECT_IC_1_MASK         0x700
#define R242_MP4_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP5_MODE (IC 1) */
#define R243_MP5_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R243_MP5_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R243_MP5_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R243_MP5_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R243_MP5_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R243_MP5_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R243_MP5_MODE_MP_MODE_IC_1_MASK           0xE
#define R243_MP5_MODE_MP_MODE_IC_1_SHIFT          1
#define R243_MP5_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R243_MP5_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R243_MP5_MODE_SS_SELECT_IC_1_MASK         0x700
#define R243_MP5_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP6_MODE (IC 1) */
#define R244_MP6_MODE_MP_ENABLE_IC_1              0x1    /* 1b	[0] */
#define R244_MP6_MODE_MP_MODE_IC_1                0x3    /* 011b	[3:1] */
#define R244_MP6_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R244_MP6_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R244_MP6_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R244_MP6_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R244_MP6_MODE_MP_MODE_IC_1_MASK           0xE
#define R244_MP6_MODE_MP_MODE_IC_1_SHIFT          1
#define R244_MP6_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R244_MP6_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R244_MP6_MODE_SS_SELECT_IC_1_MASK         0x700
#define R244_MP6_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP7_MODE (IC 1) */
#define R245_MP7_MODE_MP_ENABLE_IC_1              0x1    /* 1b	[0] */
#define R245_MP7_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R245_MP7_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R245_MP7_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R245_MP7_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R245_MP7_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R245_MP7_MODE_MP_MODE_IC_1_MASK           0xE
#define R245_MP7_MODE_MP_MODE_IC_1_SHIFT          1
#define R245_MP7_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R245_MP7_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R245_MP7_MODE_SS_SELECT_IC_1_MASK         0x700
#define R245_MP7_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP8_MODE (IC 1) */
#define R246_MP8_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R246_MP8_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R246_MP8_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R246_MP8_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R246_MP8_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R246_MP8_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R246_MP8_MODE_MP_MODE_IC_1_MASK           0xE
#define R246_MP8_MODE_MP_MODE_IC_1_SHIFT          1
#define R246_MP8_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R246_MP8_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R246_MP8_MODE_SS_SELECT_IC_1_MASK         0x700
#define R246_MP8_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP9_MODE (IC 1) */
#define R247_MP9_MODE_MP_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R247_MP9_MODE_MP_MODE_IC_1                0x0    /* 000b	[3:1] */
#define R247_MP9_MODE_DEBOUNCE_VALUE_IC_1         0x0    /* 0000b	[7:4] */
#define R247_MP9_MODE_SS_SELECT_IC_1              0x0    /* 000b	[10:8] */
#define R247_MP9_MODE_MP_ENABLE_IC_1_MASK         0x1
#define R247_MP9_MODE_MP_ENABLE_IC_1_SHIFT        0
#define R247_MP9_MODE_MP_MODE_IC_1_MASK           0xE
#define R247_MP9_MODE_MP_MODE_IC_1_SHIFT          1
#define R247_MP9_MODE_DEBOUNCE_VALUE_IC_1_MASK    0xF0
#define R247_MP9_MODE_DEBOUNCE_VALUE_IC_1_SHIFT   4
#define R247_MP9_MODE_SS_SELECT_IC_1_MASK         0x700
#define R247_MP9_MODE_SS_SELECT_IC_1_SHIFT        8

/* MP10_MODE (IC 1) */
#define R248_MP10_MODE_MP_ENABLE_IC_1             0x0    /* 0b	[0] */
#define R248_MP10_MODE_MP_MODE_IC_1               0x0    /* 000b	[3:1] */
#define R248_MP10_MODE_DEBOUNCE_VALUE_IC_1        0x0    /* 0000b	[7:4] */
#define R248_MP10_MODE_SS_SELECT_IC_1             0x0    /* 000b	[10:8] */
#define R248_MP10_MODE_MP_ENABLE_IC_1_MASK        0x1
#define R248_MP10_MODE_MP_ENABLE_IC_1_SHIFT       0
#define R248_MP10_MODE_MP_MODE_IC_1_MASK          0xE
#define R248_MP10_MODE_MP_MODE_IC_1_SHIFT         1
#define R248_MP10_MODE_DEBOUNCE_VALUE_IC_1_MASK   0xF0
#define R248_MP10_MODE_DEBOUNCE_VALUE_IC_1_SHIFT  4
#define R248_MP10_MODE_SS_SELECT_IC_1_MASK        0x700
#define R248_MP10_MODE_SS_SELECT_IC_1_SHIFT       8

/* MP11_MODE (IC 1) */
#define R249_MP11_MODE_MP_ENABLE_IC_1             0x0    /* 0b	[0] */
#define R249_MP11_MODE_MP_MODE_IC_1               0x0    /* 000b	[3:1] */
#define R249_MP11_MODE_DEBOUNCE_VALUE_IC_1        0x0    /* 0000b	[7:4] */
#define R249_MP11_MODE_SS_SELECT_IC_1             0x0    /* 000b	[10:8] */
#define R249_MP11_MODE_MP_ENABLE_IC_1_MASK        0x1
#define R249_MP11_MODE_MP_ENABLE_IC_1_SHIFT       0
#define R249_MP11_MODE_MP_MODE_IC_1_MASK          0xE
#define R249_MP11_MODE_MP_MODE_IC_1_SHIFT         1
#define R249_MP11_MODE_DEBOUNCE_VALUE_IC_1_MASK   0xF0
#define R249_MP11_MODE_DEBOUNCE_VALUE_IC_1_SHIFT  4
#define R249_MP11_MODE_SS_SELECT_IC_1_MASK        0x700
#define R249_MP11_MODE_SS_SELECT_IC_1_SHIFT       8

/* MP12_MODE (IC 1) */
#define R250_MP12_MODE_MP_ENABLE_IC_1             0x0    /* 0b	[0] */
#define R250_MP12_MODE_MP_MODE_IC_1               0x0    /* 000b	[3:1] */
#define R250_MP12_MODE_DEBOUNCE_VALUE_IC_1        0x0    /* 0000b	[7:4] */
#define R250_MP12_MODE_SS_SELECT_IC_1             0x0    /* 000b	[10:8] */
#define R250_MP12_MODE_MP_ENABLE_IC_1_MASK        0x1
#define R250_MP12_MODE_MP_ENABLE_IC_1_SHIFT       0
#define R250_MP12_MODE_MP_MODE_IC_1_MASK          0xE
#define R250_MP12_MODE_MP_MODE_IC_1_SHIFT         1
#define R250_MP12_MODE_DEBOUNCE_VALUE_IC_1_MASK   0xF0
#define R250_MP12_MODE_DEBOUNCE_VALUE_IC_1_SHIFT  4
#define R250_MP12_MODE_SS_SELECT_IC_1_MASK        0x700
#define R250_MP12_MODE_SS_SELECT_IC_1_SHIFT       8

