mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* MP13_MODE (IC 1) */
#define R251_MP13_MODE_MP_ENABLE_IC_1             0x0    /* 0b	[0] */
#define R251_MP13_MODE_MP_MODE_IC_1               0x0    /* 000b	[3:1] */
#define R251_MP13_MODE_DEBOUNCE_VALUE_IC_1        0x0    /* 0000b	[7:4] */
#define R251_MP13_MODE_SS_SELECT_IC_1             0x0    /* 000b	[10:8] */
#define R251_MP13_MODE_MP_ENABLE_IC_1_MASK        0x1
#define R251_MP13_MODE_MP_ENABLE_IC_1_SHIFT       0
#define R251_MP13_MODE_MP_MODE_IC_1_MASK          0xE
#define R251_MP13_MODE_MP_MODE_IC_1_SHIFT         1
#define R251_MP13_MODE_DEBOUNCE_VALUE_IC_1_MASK   0xF0
#define R251_MP13_MODE_DEBOUNCE_VALUE_IC_1_SHIFT  4
#define R251_MP13_MODE_SS_SELECT_IC_1_MASK        0x700
#define R251_MP13_MODE_SS_SELECT_IC_1_SHIFT       8

/* MP0_WRITE (IC 1) */
#define R252_MP0_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R252_MP0_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R252_MP0_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP1_WRITE (IC 1) */
#define R253_MP1_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R253_MP1_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R253_MP1_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP2_WRITE (IC 1) */
#define R254_MP2_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R254_MP2_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R254_MP2_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP3_WRITE (IC 1) */
#define R255_MP3_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R255_MP3_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R255_MP3_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP4_WRITE (IC 1) */
#define R256_MP4_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R256_MP4_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R256_MP4_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP5_WRITE (IC 1) */
#define R257_MP5_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R257_MP5_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R257_MP5_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP6_WRITE (IC 1) */
#define R258_MP6_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R258_MP6_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R258_MP6_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP7_WRITE (IC 1) */
#define R259_MP7_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R259_MP7_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R259_MP7_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP8_WRITE (IC 1) */
#define R260_MP8_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R260_MP8_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R260_MP8_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP9_WRITE (IC 1) */
#define R261_MP9_WRITE_MP_REG_WRITE_IC_1          0x0    /* 0b	[0] */
#define R261_MP9_WRITE_MP_REG_WRITE_IC_1_MASK     0x1
#define R261_MP9_WRITE_MP_REG_WRITE_IC_1_SHIFT    0

/* MP10_WRITE (IC 1) */
#define R262_MP10_WRITE_MP_REG_WRITE_IC_1         0x0    /* 0b	[0] */
#define R262_MP10_WRITE_MP_REG_WRITE_IC_1_MASK    0x1
#define R262_MP10_WRITE_MP_REG_WRITE_IC_1_SHIFT   0

/* MP11_WRITE (IC 1) */
#define R263_MP11_WRITE_MP_REG_WRITE_IC_1         0x0    /* 0b	[0] */
#define R263_MP11_WRITE_MP_REG_WRITE_IC_1_MASK    0x1
#define R263_MP11_WRITE_MP_REG_WRITE_IC_1_SHIFT   0

/* MP12_WRITE (IC 1) */
#define R264_MP12_WRITE_MP_REG_WRITE_IC_1         0x0    /* 0b	[0] */
#define R264_MP12_WRITE_MP_REG_WRITE_IC_1_MASK    0x1
#define R264_MP12_WRITE_MP_REG_WRITE_IC_1_SHIFT   0

/* MP13_WRITE (IC 1) */
#define R265_MP13_WRITE_MP_REG_WRITE_IC_1         0x0    /* 0b	[0] */
#define R265_MP13_WRITE_MP_REG_WRITE_IC_1_MASK    0x1
#define R265_MP13_WRITE_MP_REG_WRITE_IC_1_SHIFT   0

/* MP0_READ (IC 1) */
#define R266_MP0_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R266_MP0_READ_MP_REG_READ_IC_1_MASK       0x1
#define R266_MP0_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP1_READ (IC 1) */
#define R267_MP1_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R267_MP1_READ_MP_REG_READ_IC_1_MASK       0x1
#define R267_MP1_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP2_READ (IC 1) */
#define R268_MP2_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R268_MP2_READ_MP_REG_READ_IC_1_MASK       0x1
#define R268_MP2_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP3_READ (IC 1) */
#define R269_MP3_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R269_MP3_READ_MP_REG_READ_IC_1_MASK       0x1
#define R269_MP3_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP4_READ (IC 1) */
#define R270_MP4_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R270_MP4_READ_MP_REG_READ_IC_1_MASK       0x1
#define R270_MP4_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP5_READ (IC 1) */
#define R271_MP5_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R271_MP5_READ_MP_REG_READ_IC_1_MASK       0x1
#define R271_MP5_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP6_READ (IC 1) */
#define R272_MP6_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R272_MP6_READ_MP_REG_READ_IC_1_MASK       0x1
#define R272_MP6_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP7_READ (IC 1) */
#define R273_MP7_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R273_MP7_READ_MP_REG_READ_IC_1_MASK       0x1
#define R273_MP7_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP8_READ (IC 1) */
#define R274_MP8_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R274_MP8_READ_MP_REG_READ_IC_1_MASK       0x1
#define R274_MP8_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP9_READ (IC 1) */
#define R275_MP9_READ_MP_REG_READ_IC_1            0x0    /* 0b	[0] */
#define R275_MP9_READ_MP_REG_READ_IC_1_MASK       0x1
#define R275_MP9_READ_MP_REG_READ_IC_1_SHIFT      0

/* MP10_READ (IC 1) */
#define R276_MP10_READ_MP_REG_READ_IC_1           0x0    /* 0b	[0] */
#define R276_MP10_READ_MP_REG_READ_IC_1_MASK      0x1
#define R276_MP10_READ_MP_REG_READ_IC_1_SHIFT     0

/* MP11_READ (IC 1) */
#define R277_MP11_READ_MP_REG_READ_IC_1           0x0    /* 0b	[0] */
#define R277_MP11_READ_MP_REG_READ_IC_1_MASK      0x1
#define R277_MP11_READ_MP_REG_READ_IC_1_SHIFT     0

/* MP12_READ (IC 1) */
#define R278_MP12_READ_MP_REG_READ_IC_1           0x0    /* 0b	[0] */
#define R278_MP12_READ_MP_REG_READ_IC_1_MASK      0x1
#define R278_MP12_READ_MP_REG_READ_IC_1_SHIFT     0

