mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* ASRC6_RAMPMAX (IC 1) */
#define R299_ASRC6_RAMPMAX_RAMPMAX_VALUE_IC_1     0x7FF  /* 11111111111b	[10:0] */
#define R299_ASRC6_RAMPMAX_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R299_ASRC6_RAMPMAX_RAMPMAX_VALUE_IC_1_SHIFT 0

/* ASRC7_RAMPMAX (IC 1) */
#define R300_ASRC7_RAMPMAX_RAMPMAX_VALUE_IC_1     0x7FF  /* 11111111111b	[10:0] */
#define R300_ASRC7_RAMPMAX_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R300_ASRC7_RAMPMAX_RAMPMAX_VALUE_IC_1_SHIFT 0

/* ADC_READ0 (IC 1) */
#define R301_ADC_READ0_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R301_ADC_READ0_ADC_VALUE_IC_1_MASK        0xFFFF
#define R301_ADC_READ0_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ1 (IC 1) */
#define R302_ADC_READ1_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R302_ADC_READ1_ADC_VALUE_IC_1_MASK        0xFFFF
#define R302_ADC_READ1_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ2 (IC 1) */
#define R303_ADC_READ2_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R303_ADC_READ2_ADC_VALUE_IC_1_MASK        0xFFFF
#define R303_ADC_READ2_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ3 (IC 1) */
#define R304_ADC_READ3_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R304_ADC_READ3_ADC_VALUE_IC_1_MASK        0xFFFF
#define R304_ADC_READ3_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ4 (IC 1) */
#define R305_ADC_READ4_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R305_ADC_READ4_ADC_VALUE_IC_1_MASK        0xFFFF
#define R305_ADC_READ4_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ5 (IC 1) */
#define R306_ADC_READ5_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R306_ADC_READ5_ADC_VALUE_IC_1_MASK        0xFFFF
#define R306_ADC_READ5_ADC_VALUE_IC_1_SHIFT       0

/* MP0_MODE1 (IC 1) */
#define R307_MP0_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R307_MP0_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R307_MP0_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R307_MP0_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R307_MP0_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R307_MP0_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R307_MP0_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R307_MP0_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R307_MP0_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R307_MP0_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R307_MP0_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R307_MP0_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP1_MODE1 (IC 1) */
#define R308_MP1_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R308_MP1_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R308_MP1_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R308_MP1_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R308_MP1_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R308_MP1_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R308_MP1_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R308_MP1_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R308_MP1_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R308_MP1_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R308_MP1_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R308_MP1_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP2_MODE1 (IC 1) */
#define R309_MP2_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R309_MP2_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R309_MP2_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R309_MP2_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R309_MP2_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R309_MP2_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R309_MP2_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R309_MP2_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R309_MP2_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R309_MP2_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R309_MP2_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R309_MP2_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP3_MODE1 (IC 1) */
#define R310_MP3_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R310_MP3_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R310_MP3_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R310_MP3_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R310_MP3_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R310_MP3_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R310_MP3_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R310_MP3_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R310_MP3_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R310_MP3_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R310_MP3_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R310_MP3_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP4_MODE1 (IC 1) */
#define R311_MP4_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R311_MP4_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R311_MP4_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R311_MP4_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R311_MP4_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R311_MP4_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R311_MP4_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R311_MP4_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R311_MP4_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R311_MP4_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R311_MP4_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R311_MP4_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP5_MODE1 (IC 1) */
#define R312_MP5_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R312_MP5_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R312_MP5_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R312_MP5_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R312_MP5_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R312_MP5_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R312_MP5_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R312_MP5_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R312_MP5_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R312_MP5_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R312_MP5_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R312_MP5_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP6_MODE1 (IC 1) */
#define R313_MP6_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R313_MP6_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R313_MP6_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R313_MP6_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R313_MP6_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R313_MP6_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R313_MP6_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R313_MP6_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R313_MP6_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R313_MP6_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R313_MP6_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R313_MP6_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP7_MODE1 (IC 1) */
#define R314_MP7_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R314_MP7_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R314_MP7_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R314_MP7_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R314_MP7_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R314_MP7_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R314_MP7_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R314_MP7_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R314_MP7_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R314_MP7_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R314_MP7_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R314_MP7_MODE1_SS_SELECT1_IC_1_SHIFT      8

