mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* MP8_MODE1 (IC 1) */
#define R315_MP8_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R315_MP8_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R315_MP8_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R315_MP8_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R315_MP8_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R315_MP8_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R315_MP8_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R315_MP8_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R315_MP8_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R315_MP8_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R315_MP8_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R315_MP8_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP9_MODE1 (IC 1) */
#define R316_MP9_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R316_MP9_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R316_MP9_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R316_MP9_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R316_MP9_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R316_MP9_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R316_MP9_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R316_MP9_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R316_MP9_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R316_MP9_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R316_MP9_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R316_MP9_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP10_MODE1 (IC 1) */
#define R317_MP10_MODE1_MP_ENABLE1_IC_1           0x0    /* 0b	[0] */
#define R317_MP10_MODE1_MP_MODE1_IC_1             0x0    /* 000b	[3:1] */
#define R317_MP10_MODE1_DEBOUNCE_VALUE1_IC_1      0x0    /* 0000b	[7:4] */
#define R317_MP10_MODE1_SS_SELECT1_IC_1           0x0    /* 000b	[10:8] */
#define R317_MP10_MODE1_MP_ENABLE1_IC_1_MASK      0x1
#define R317_MP10_MODE1_MP_ENABLE1_IC_1_SHIFT     0
#define R317_MP10_MODE1_MP_MODE1_IC_1_MASK        0xE
#define R317_MP10_MODE1_MP_MODE1_IC_1_SHIFT       1
#define R317_MP10_MODE1_DEBOUNCE_VALUE1_IC_1_MASK 0xF0
#define R317_MP10_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R317_MP10_MODE1_SS_SELECT1_IC_1_MASK      0x700
#define R317_MP10_MODE1_SS_SELECT1_IC_1_SHIFT     8

/* MP11_MODE1 (IC 1) */
#define R318_MP11_MODE1_MP_ENABLE1_IC_1           0x0    /* 0b	[0] */
#define R318_MP11_MODE1_MP_MODE1_IC_1             0x0    /* 000b	[3:1] */
#define R318_MP11_MODE1_DEBOUNCE_VALUE1_IC_1      0x0    /* 0000b	[7:4] */
#define R318_MP11_MODE1_SS_SELECT1_IC_1           0x0    /* 000b	[10:8] */
#define R318_MP11_MODE1_MP_ENABLE1_IC_1_MASK      0x1
#define R318_MP11_MODE1_MP_ENABLE1_IC_1_SHIFT     0
#define R318_MP11_MODE1_MP_MODE1_IC_1_MASK        0xE
#define R318_MP11_MODE1_MP_MODE1_IC_1_SHIFT       1
#define R318_MP11_MODE1_DEBOUNCE_VALUE1_IC_1_MASK 0xF0
#define R318_MP11_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R318_MP11_MODE1_SS_SELECT1_IC_1_MASK      0x700
#define R318_MP11_MODE1_SS_SELECT1_IC_1_SHIFT     8

/* MP0_WRITE1 (IC 1) */
#define R319_MP0_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R319_MP0_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R319_MP0_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP1_WRITE1 (IC 1) */
#define R320_MP1_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R320_MP1_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R320_MP1_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP2_WRITE1 (IC 1) */
#define R321_MP2_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R321_MP2_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R321_MP2_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP3_WRITE1 (IC 1) */
#define R322_MP3_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R322_MP3_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R322_MP3_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP4_WRITE1 (IC 1) */
#define R323_MP4_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R323_MP4_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R323_MP4_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP5_WRITE1 (IC 1) */
#define R324_MP5_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R324_MP5_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R324_MP5_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP6_WRITE1 (IC 1) */
#define R325_MP6_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R325_MP6_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R325_MP6_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP7_WRITE1 (IC 1) */
#define R326_MP7_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R326_MP7_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R326_MP7_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP8_WRITE1 (IC 1) */
#define R327_MP8_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R327_MP8_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R327_MP8_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP9_WRITE1 (IC 1) */
#define R328_MP9_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R328_MP9_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R328_MP9_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP10_WRITE1 (IC 1) */
#define R329_MP10_WRITE1_MP_REG_WRITE1_IC_1       0x0    /* 0b	[0] */
#define R329_MP10_WRITE1_MP_REG_WRITE1_IC_1_MASK  0x1
#define R329_MP10_WRITE1_MP_REG_WRITE1_IC_1_SHIFT 0

/* MP11_WRITE1 (IC 1) */
#define R330_MP11_WRITE1_MP_REG_WRITE1_IC_1       0x0    /* 0b	[0] */
#define R330_MP11_WRITE1_MP_REG_WRITE1_IC_1_MASK  0x1
#define R330_MP11_WRITE1_MP_REG_WRITE1_IC_1_SHIFT 0

/* MP0_READ1 (IC 1) */
#define R331_MP0_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R331_MP0_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R331_MP0_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP1_READ1 (IC 1) */
#define R332_MP1_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R332_MP1_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R332_MP1_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP2_READ1 (IC 1) */
#define R333_MP2_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R333_MP2_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R333_MP2_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP3_READ1 (IC 1) */
#define R334_MP3_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R334_MP3_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R334_MP3_READ1_MP_REG_READ1_IC_1_SHIFT    0

