mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* MP4_READ1 (IC 1) */
#define R335_MP4_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R335_MP4_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R335_MP4_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP5_READ1 (IC 1) */
#define R336_MP5_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R336_MP5_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R336_MP5_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP6_READ1 (IC 1) */
#define R337_MP6_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R337_MP6_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R337_MP6_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP7_READ1 (IC 1) */
#define R338_MP7_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R338_MP7_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R338_MP7_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP8_READ1 (IC 1) */
#define R339_MP8_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R339_MP8_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R339_MP8_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP9_READ1 (IC 1) */
#define R340_MP9_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R340_MP9_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R340_MP9_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP10_READ1 (IC 1) */
#define R341_MP10_READ1_MP_REG_READ1_IC_1         0x0    /* 0b	[0] */
#define R341_MP10_READ1_MP_REG_READ1_IC_1_MASK    0x1
#define R341_MP10_READ1_MP_REG_READ1_IC_1_SHIFT   0

/* MP11_READ1 (IC 1) */
#define R342_MP11_READ1_MP_REG_READ1_IC_1         0x0    /* 0b	[0] */
#define R342_MP11_READ1_MP_REG_READ1_IC_1_MASK    0x1
#define R342_MP11_READ1_MP_REG_READ1_IC_1_SHIFT   0

/* SPDIF_LOCK_DET (IC 1) */
#define R343_SPDIF_LOCK_DET_LOCK_IC_1             0x0    /* 0b	[0] */
#define R343_SPDIF_LOCK_DET_LOCK_IC_1_MASK        0x1
#define R343_SPDIF_LOCK_DET_LOCK_IC_1_SHIFT       0

/* SPDIF_RX_CTRL (IC 1) */
#define R344_SPDIF_RX_CTRL_RX_LENGTHCTRL_IC_1     0x0    /* 00b	[1:0] */
#define R344_SPDIF_RX_CTRL_FSOUTSTRENGTH_IC_1     0x0    /* 0b	[2] */
#define R344_SPDIF_RX_CTRL_FASTLOCK_IC_1          0x0    /* 0b	[3] */
#define R344_SPDIF_RX_CTRL_RX_LENGTHCTRL_IC_1_MASK 0x3
#define R344_SPDIF_RX_CTRL_RX_LENGTHCTRL_IC_1_SHIFT 0
#define R344_SPDIF_RX_CTRL_FSOUTSTRENGTH_IC_1_MASK 0x4
#define R344_SPDIF_RX_CTRL_FSOUTSTRENGTH_IC_1_SHIFT 2
#define R344_SPDIF_RX_CTRL_FASTLOCK_IC_1_MASK     0x8
#define R344_SPDIF_RX_CTRL_FASTLOCK_IC_1_SHIFT    3

/* SPDIF_RX_DECODE (IC 1) */
#define R345_SPDIF_RX_DECODE_AUDIO_TYPE_IC_1      0x0    /* 0b	[0] */
#define R345_SPDIF_RX_DECODE_COMPR_TYPE_IC_1      0x0    /* 0b	[1] */
#define R345_SPDIF_RX_DECODE_RX_WORDLENGTH_L_IC_1 0x2    /* 0010b	[5:2] */
#define R345_SPDIF_RX_DECODE_RX_WORDLENGTH_R_IC_1 0x2    /* 0010b	[9:6] */
#define R345_SPDIF_RX_DECODE_AUDIO_TYPE_IC_1_MASK 0x1
#define R345_SPDIF_RX_DECODE_AUDIO_TYPE_IC_1_SHIFT 0
#define R345_SPDIF_RX_DECODE_COMPR_TYPE_IC_1_MASK 0x2
#define R345_SPDIF_RX_DECODE_COMPR_TYPE_IC_1_SHIFT 1
#define R345_SPDIF_RX_DECODE_RX_WORDLENGTH_L_IC_1_MASK 0x3C
#define R345_SPDIF_RX_DECODE_RX_WORDLENGTH_L_IC_1_SHIFT 2
#define R345_SPDIF_RX_DECODE_RX_WORDLENGTH_R_IC_1_MASK 0x3C0
#define R345_SPDIF_RX_DECODE_RX_WORDLENGTH_R_IC_1_SHIFT 6

/* SPDIF_RX_COMPRMODE (IC 1) */
#define R346_SPDIF_RX_COMPRMODE_COMPR_MODE_IC_1   0x0000 /* 0000000000000000b	[15:0] */
#define R346_SPDIF_RX_COMPRMODE_COMPR_MODE_IC_1_MASK 0xFFFF
#define R346_SPDIF_RX_COMPRMODE_COMPR_MODE_IC_1_SHIFT 0

/* SPDIF_RESTART (IC 1) */
#define R347_SPDIF_RESTART_RESTART_AUDIO_IC_1     0x0    /* 0b	[0] */
#define R347_SPDIF_RESTART_RESTART_AUDIO_IC_1_MASK 0x1
#define R347_SPDIF_RESTART_RESTART_AUDIO_IC_1_SHIFT 0

/* SPDIF_LOSS_OF_LOCK (IC 1) */
#define R348_SPDIF_LOSS_OF_LOCK_LOSS_OF_LOCK_IC_1 0x0    /* 0b	[0] */
#define R348_SPDIF_LOSS_OF_LOCK_LOSS_OF_LOCK_IC_1_MASK 0x1
#define R348_SPDIF_LOSS_OF_LOCK_LOSS_OF_LOCK_IC_1_SHIFT 0

/* SPDIF_RX_MCLKSPEED (IC 1) */
#define R349_SPDIF_RX_MCLKSPEED_RX_MCLKSPEED_IC_1 0x1    /* 1b	[0] */
#define R349_SPDIF_RX_MCLKSPEED_RX_MCLKSPEED_IC_1_MASK 0x1
#define R349_SPDIF_RX_MCLKSPEED_RX_MCLKSPEED_IC_1_SHIFT 0

/* SPDIF_TX_MCLKSPEED (IC 1) */
#define R350_SPDIF_TX_MCLKSPEED_TX_MCLKSPEED_IC_1 0x1    /* 1b	[0] */
#define R350_SPDIF_TX_MCLKSPEED_TX_MCLKSPEED_IC_1_MASK 0x1
#define R350_SPDIF_TX_MCLKSPEED_TX_MCLKSPEED_IC_1_SHIFT 0

/* SPDIF_AUX_EN (IC 1) */
#define R351_SPDIF_AUX_EN_TDMOUT_IC_1             0x0    /* 0000b	[3:0] */
#define R351_SPDIF_AUX_EN_TDMOUT_CLK_IC_1         0x0    /* 0b	[4] */
#define R351_SPDIF_AUX_EN_TDMOUT_IC_1_MASK        0xF
#define R351_SPDIF_AUX_EN_TDMOUT_IC_1_SHIFT       0
#define R351_SPDIF_AUX_EN_TDMOUT_CLK_IC_1_MASK    0x10
#define R351_SPDIF_AUX_EN_TDMOUT_CLK_IC_1_SHIFT   4

/* SPDIF_RX_AUXBIT_READY (IC 1) */
#define R352_SPDIF_RX_AUXBIT_READY_AUXBITS_READY_IC_1 0x0 /* 0b	[0] */
#define R352_SPDIF_RX_AUXBIT_READY_AUXBITS_READY_IC_1_MASK 0x1
#define R352_SPDIF_RX_AUXBIT_READY_AUXBITS_READY_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_0 (IC 1) */
#define R353_SPDIF_RX_CS_LEFT_0_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R353_SPDIF_RX_CS_LEFT_0_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R353_SPDIF_RX_CS_LEFT_0_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_1 (IC 1) */
#define R354_SPDIF_RX_CS_LEFT_1_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R354_SPDIF_RX_CS_LEFT_1_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R354_SPDIF_RX_CS_LEFT_1_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_2 (IC 1) */
#define R355_SPDIF_RX_CS_LEFT_2_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R355_SPDIF_RX_CS_LEFT_2_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R355_SPDIF_RX_CS_LEFT_2_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_3 (IC 1) */
#define R356_SPDIF_RX_CS_LEFT_3_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R356_SPDIF_RX_CS_LEFT_3_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R356_SPDIF_RX_CS_LEFT_3_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_4 (IC 1) */
#define R357_SPDIF_RX_CS_LEFT_4_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R357_SPDIF_RX_CS_LEFT_4_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R357_SPDIF_RX_CS_LEFT_4_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

