mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* SPDIF_RX_CS_LEFT_5 (IC 1) */
#define R358_SPDIF_RX_CS_LEFT_5_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R358_SPDIF_RX_CS_LEFT_5_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R358_SPDIF_RX_CS_LEFT_5_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_6 (IC 1) */
#define R359_SPDIF_RX_CS_LEFT_6_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R359_SPDIF_RX_CS_LEFT_6_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R359_SPDIF_RX_CS_LEFT_6_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_7 (IC 1) */
#define R360_SPDIF_RX_CS_LEFT_7_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R360_SPDIF_RX_CS_LEFT_7_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R360_SPDIF_RX_CS_LEFT_7_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_8 (IC 1) */
#define R361_SPDIF_RX_CS_LEFT_8_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R361_SPDIF_RX_CS_LEFT_8_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R361_SPDIF_RX_CS_LEFT_8_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_9 (IC 1) */
#define R362_SPDIF_RX_CS_LEFT_9_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R362_SPDIF_RX_CS_LEFT_9_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R362_SPDIF_RX_CS_LEFT_9_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_10 (IC 1) */
#define R363_SPDIF_RX_CS_LEFT_10_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R363_SPDIF_RX_CS_LEFT_10_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R363_SPDIF_RX_CS_LEFT_10_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_11 (IC 1) */
#define R364_SPDIF_RX_CS_LEFT_11_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R364_SPDIF_RX_CS_LEFT_11_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R364_SPDIF_RX_CS_LEFT_11_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_0 (IC 1) */
#define R365_SPDIF_RX_CS_RIGHT_0_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R365_SPDIF_RX_CS_RIGHT_0_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R365_SPDIF_RX_CS_RIGHT_0_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_1 (IC 1) */
#define R366_SPDIF_RX_CS_RIGHT_1_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R366_SPDIF_RX_CS_RIGHT_1_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R366_SPDIF_RX_CS_RIGHT_1_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_2 (IC 1) */
#define R367_SPDIF_RX_CS_RIGHT_2_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R367_SPDIF_RX_CS_RIGHT_2_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R367_SPDIF_RX_CS_RIGHT_2_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_3 (IC 1) */
#define R368_SPDIF_RX_CS_RIGHT_3_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R368_SPDIF_RX_CS_RIGHT_3_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R368_SPDIF_RX_CS_RIGHT_3_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_4 (IC 1) */
#define R369_SPDIF_RX_CS_RIGHT_4_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R369_SPDIF_RX_CS_RIGHT_4_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R369_SPDIF_RX_CS_RIGHT_4_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_5 (IC 1) */
#define R370_SPDIF_RX_CS_RIGHT_5_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R370_SPDIF_RX_CS_RIGHT_5_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R370_SPDIF_RX_CS_RIGHT_5_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_6 (IC 1) */
#define R371_SPDIF_RX_CS_RIGHT_6_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R371_SPDIF_RX_CS_RIGHT_6_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R371_SPDIF_RX_CS_RIGHT_6_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_7 (IC 1) */
#define R372_SPDIF_RX_CS_RIGHT_7_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R372_SPDIF_RX_CS_RIGHT_7_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R372_SPDIF_RX_CS_RIGHT_7_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_8 (IC 1) */
#define R373_SPDIF_RX_CS_RIGHT_8_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R373_SPDIF_RX_CS_RIGHT_8_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R373_SPDIF_RX_CS_RIGHT_8_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_9 (IC 1) */
#define R374_SPDIF_RX_CS_RIGHT_9_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R374_SPDIF_RX_CS_RIGHT_9_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R374_SPDIF_RX_CS_RIGHT_9_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_10 (IC 1) */
#define R375_SPDIF_RX_CS_RIGHT_10_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R375_SPDIF_RX_CS_RIGHT_10_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R375_SPDIF_RX_CS_RIGHT_10_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_CS_RIGHT_11 (IC 1) */
#define R376_SPDIF_RX_CS_RIGHT_11_SPDIF_RX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R376_SPDIF_RX_CS_RIGHT_11_SPDIF_RX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R376_SPDIF_RX_CS_RIGHT_11_SPDIF_RX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_0 (IC 1) */
#define R377_SPDIF_RX_UD_LEFT_0_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R377_SPDIF_RX_UD_LEFT_0_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R377_SPDIF_RX_UD_LEFT_0_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_1 (IC 1) */
#define R378_SPDIF_RX_UD_LEFT_1_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R378_SPDIF_RX_UD_LEFT_1_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R378_SPDIF_RX_UD_LEFT_1_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_2 (IC 1) */
#define R379_SPDIF_RX_UD_LEFT_2_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R379_SPDIF_RX_UD_LEFT_2_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R379_SPDIF_RX_UD_LEFT_2_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_3 (IC 1) */
#define R380_SPDIF_RX_UD_LEFT_3_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R380_SPDIF_RX_UD_LEFT_3_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R380_SPDIF_RX_UD_LEFT_3_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_4 (IC 1) */
#define R381_SPDIF_RX_UD_LEFT_4_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R381_SPDIF_RX_UD_LEFT_4_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R381_SPDIF_RX_UD_LEFT_4_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_5 (IC 1) */
#define R382_SPDIF_RX_UD_LEFT_5_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R382_SPDIF_RX_UD_LEFT_5_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R382_SPDIF_RX_UD_LEFT_5_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

