mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* SPDIF_RX_UD_LEFT_6 (IC 1) */
#define R383_SPDIF_RX_UD_LEFT_6_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R383_SPDIF_RX_UD_LEFT_6_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R383_SPDIF_RX_UD_LEFT_6_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_7 (IC 1) */
#define R384_SPDIF_RX_UD_LEFT_7_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R384_SPDIF_RX_UD_LEFT_7_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R384_SPDIF_RX_UD_LEFT_7_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_8 (IC 1) */
#define R385_SPDIF_RX_UD_LEFT_8_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R385_SPDIF_RX_UD_LEFT_8_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R385_SPDIF_RX_UD_LEFT_8_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_9 (IC 1) */
#define R386_SPDIF_RX_UD_LEFT_9_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R386_SPDIF_RX_UD_LEFT_9_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R386_SPDIF_RX_UD_LEFT_9_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_10 (IC 1) */
#define R387_SPDIF_RX_UD_LEFT_10_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R387_SPDIF_RX_UD_LEFT_10_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R387_SPDIF_RX_UD_LEFT_10_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_LEFT_11 (IC 1) */
#define R388_SPDIF_RX_UD_LEFT_11_SPDIF_RX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R388_SPDIF_RX_UD_LEFT_11_SPDIF_RX_UD_LEFT_IC_1_MASK 0xFFFF
#define R388_SPDIF_RX_UD_LEFT_11_SPDIF_RX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_0 (IC 1) */
#define R389_SPDIF_RX_UD_RIGHT_0_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R389_SPDIF_RX_UD_RIGHT_0_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R389_SPDIF_RX_UD_RIGHT_0_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_1 (IC 1) */
#define R390_SPDIF_RX_UD_RIGHT_1_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R390_SPDIF_RX_UD_RIGHT_1_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R390_SPDIF_RX_UD_RIGHT_1_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_2 (IC 1) */
#define R391_SPDIF_RX_UD_RIGHT_2_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R391_SPDIF_RX_UD_RIGHT_2_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R391_SPDIF_RX_UD_RIGHT_2_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_3 (IC 1) */
#define R392_SPDIF_RX_UD_RIGHT_3_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R392_SPDIF_RX_UD_RIGHT_3_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R392_SPDIF_RX_UD_RIGHT_3_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_4 (IC 1) */
#define R393_SPDIF_RX_UD_RIGHT_4_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R393_SPDIF_RX_UD_RIGHT_4_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R393_SPDIF_RX_UD_RIGHT_4_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_5 (IC 1) */
#define R394_SPDIF_RX_UD_RIGHT_5_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R394_SPDIF_RX_UD_RIGHT_5_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R394_SPDIF_RX_UD_RIGHT_5_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_6 (IC 1) */
#define R395_SPDIF_RX_UD_RIGHT_6_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R395_SPDIF_RX_UD_RIGHT_6_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R395_SPDIF_RX_UD_RIGHT_6_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_7 (IC 1) */
#define R396_SPDIF_RX_UD_RIGHT_7_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R396_SPDIF_RX_UD_RIGHT_7_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R396_SPDIF_RX_UD_RIGHT_7_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_8 (IC 1) */
#define R397_SPDIF_RX_UD_RIGHT_8_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R397_SPDIF_RX_UD_RIGHT_8_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R397_SPDIF_RX_UD_RIGHT_8_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_9 (IC 1) */
#define R398_SPDIF_RX_UD_RIGHT_9_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R398_SPDIF_RX_UD_RIGHT_9_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R398_SPDIF_RX_UD_RIGHT_9_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_10 (IC 1) */
#define R399_SPDIF_RX_UD_RIGHT_10_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R399_SPDIF_RX_UD_RIGHT_10_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R399_SPDIF_RX_UD_RIGHT_10_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_UD_RIGHT_11 (IC 1) */
#define R400_SPDIF_RX_UD_RIGHT_11_SPDIF_RX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R400_SPDIF_RX_UD_RIGHT_11_SPDIF_RX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R400_SPDIF_RX_UD_RIGHT_11_SPDIF_RX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_0 (IC 1) */
#define R401_SPDIF_RX_VB_LEFT_0_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R401_SPDIF_RX_VB_LEFT_0_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R401_SPDIF_RX_VB_LEFT_0_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_1 (IC 1) */
#define R402_SPDIF_RX_VB_LEFT_1_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R402_SPDIF_RX_VB_LEFT_1_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R402_SPDIF_RX_VB_LEFT_1_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_2 (IC 1) */
#define R403_SPDIF_RX_VB_LEFT_2_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R403_SPDIF_RX_VB_LEFT_2_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R403_SPDIF_RX_VB_LEFT_2_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_3 (IC 1) */
#define R404_SPDIF_RX_VB_LEFT_3_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R404_SPDIF_RX_VB_LEFT_3_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R404_SPDIF_RX_VB_LEFT_3_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_4 (IC 1) */
#define R405_SPDIF_RX_VB_LEFT_4_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R405_SPDIF_RX_VB_LEFT_4_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R405_SPDIF_RX_VB_LEFT_4_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_5 (IC 1) */
#define R406_SPDIF_RX_VB_LEFT_5_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R406_SPDIF_RX_VB_LEFT_5_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R406_SPDIF_RX_VB_LEFT_5_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

