mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* BCLK_IN0_PIN (IC 1) */
#define R548_BCLK_IN0_PIN_BCLK_IN_DRIVE_IC_1      0x0    /* 00b	[1:0] */
#define R548_BCLK_IN0_PIN_BCLK_IN_SLEW_IC_1       0x2    /* 10b	[3:2] */
#define R548_BCLK_IN0_PIN_BCLK_IN_PULL_IC_1       0x1    /* 1b	[4] */
#define R548_BCLK_IN0_PIN_BCLK_IN_DRIVE_IC_1_MASK 0x3
#define R548_BCLK_IN0_PIN_BCLK_IN_DRIVE_IC_1_SHIFT 0
#define R548_BCLK_IN0_PIN_BCLK_IN_SLEW_IC_1_MASK  0xC
#define R548_BCLK_IN0_PIN_BCLK_IN_SLEW_IC_1_SHIFT 2
#define R548_BCLK_IN0_PIN_BCLK_IN_PULL_IC_1_MASK  0x10
#define R548_BCLK_IN0_PIN_BCLK_IN_PULL_IC_1_SHIFT 4

/* BCLK_IN1_PIN (IC 1) */
#define R549_BCLK_IN1_PIN_BCLK_IN_DRIVE_IC_1      0x0    /* 00b	[1:0] */
#define R549_BCLK_IN1_PIN_BCLK_IN_SLEW_IC_1       0x2    /* 10b	[3:2] */
#define R549_BCLK_IN1_PIN_BCLK_IN_PULL_IC_1       0x1    /* 1b	[4] */
#define R549_BCLK_IN1_PIN_BCLK_IN_DRIVE_IC_1_MASK 0x3
#define R549_BCLK_IN1_PIN_BCLK_IN_DRIVE_IC_1_SHIFT 0
#define R549_BCLK_IN1_PIN_BCLK_IN_SLEW_IC_1_MASK  0xC
#define R549_BCLK_IN1_PIN_BCLK_IN_SLEW_IC_1_SHIFT 2
#define R549_BCLK_IN1_PIN_BCLK_IN_PULL_IC_1_MASK  0x10
#define R549_BCLK_IN1_PIN_BCLK_IN_PULL_IC_1_SHIFT 4

/* BCLK_IN2_PIN (IC 1) */
#define R550_BCLK_IN2_PIN_BCLK_IN_DRIVE_IC_1      0x0    /* 00b	[1:0] */
#define R550_BCLK_IN2_PIN_BCLK_IN_SLEW_IC_1       0x2    /* 10b	[3:2] */
#define R550_BCLK_IN2_PIN_BCLK_IN_PULL_IC_1       0x1    /* 1b	[4] */
#define R550_BCLK_IN2_PIN_BCLK_IN_DRIVE_IC_1_MASK 0x3
#define R550_BCLK_IN2_PIN_BCLK_IN_DRIVE_IC_1_SHIFT 0
#define R550_BCLK_IN2_PIN_BCLK_IN_SLEW_IC_1_MASK  0xC
#define R550_BCLK_IN2_PIN_BCLK_IN_SLEW_IC_1_SHIFT 2
#define R550_BCLK_IN2_PIN_BCLK_IN_PULL_IC_1_MASK  0x10
#define R550_BCLK_IN2_PIN_BCLK_IN_PULL_IC_1_SHIFT 4

/* BCLK_IN3_PIN (IC 1) */
#define R551_BCLK_IN3_PIN_BCLK_IN_DRIVE_IC_1      0x0    /* 00b	[1:0] */
#define R551_BCLK_IN3_PIN_BCLK_IN_SLEW_IC_1       0x2    /* 10b	[3:2] */
#define R551_BCLK_IN3_PIN_BCLK_IN_PULL_IC_1       0x1    /* 1b	[4] */
#define R551_BCLK_IN3_PIN_BCLK_IN_DRIVE_IC_1_MASK 0x3
#define R551_BCLK_IN3_PIN_BCLK_IN_DRIVE_IC_1_SHIFT 0
#define R551_BCLK_IN3_PIN_BCLK_IN_SLEW_IC_1_MASK  0xC
#define R551_BCLK_IN3_PIN_BCLK_IN_SLEW_IC_1_SHIFT 2
#define R551_BCLK_IN3_PIN_BCLK_IN_PULL_IC_1_MASK  0x10
#define R551_BCLK_IN3_PIN_BCLK_IN_PULL_IC_1_SHIFT 4

/* BCLK_OUT0_PIN (IC 1) */
#define R552_BCLK_OUT0_PIN_BCLK_OUT_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R552_BCLK_OUT0_PIN_BCLK_OUT_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R552_BCLK_OUT0_PIN_BCLK_OUT_PULL_IC_1     0x1    /* 1b	[4] */
#define R552_BCLK_OUT0_PIN_BCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R552_BCLK_OUT0_PIN_BCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R552_BCLK_OUT0_PIN_BCLK_OUT_SLEW_IC_1_MASK 0xC
#define R552_BCLK_OUT0_PIN_BCLK_OUT_SLEW_IC_1_SHIFT 2
#define R552_BCLK_OUT0_PIN_BCLK_OUT_PULL_IC_1_MASK 0x10
#define R552_BCLK_OUT0_PIN_BCLK_OUT_PULL_IC_1_SHIFT 4

/* BCLK_OUT1_PIN (IC 1) */
#define R553_BCLK_OUT1_PIN_BCLK_OUT_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R553_BCLK_OUT1_PIN_BCLK_OUT_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R553_BCLK_OUT1_PIN_BCLK_OUT_PULL_IC_1     0x1    /* 1b	[4] */
#define R553_BCLK_OUT1_PIN_BCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R553_BCLK_OUT1_PIN_BCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R553_BCLK_OUT1_PIN_BCLK_OUT_SLEW_IC_1_MASK 0xC
#define R553_BCLK_OUT1_PIN_BCLK_OUT_SLEW_IC_1_SHIFT 2
#define R553_BCLK_OUT1_PIN_BCLK_OUT_PULL_IC_1_MASK 0x10
#define R553_BCLK_OUT1_PIN_BCLK_OUT_PULL_IC_1_SHIFT 4

/* BCLK_OUT2_PIN (IC 1) */
#define R554_BCLK_OUT2_PIN_BCLK_OUT_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R554_BCLK_OUT2_PIN_BCLK_OUT_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R554_BCLK_OUT2_PIN_BCLK_OUT_PULL_IC_1     0x1    /* 1b	[4] */
#define R554_BCLK_OUT2_PIN_BCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R554_BCLK_OUT2_PIN_BCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R554_BCLK_OUT2_PIN_BCLK_OUT_SLEW_IC_1_MASK 0xC
#define R554_BCLK_OUT2_PIN_BCLK_OUT_SLEW_IC_1_SHIFT 2
#define R554_BCLK_OUT2_PIN_BCLK_OUT_PULL_IC_1_MASK 0x10
#define R554_BCLK_OUT2_PIN_BCLK_OUT_PULL_IC_1_SHIFT 4

/* BCLK_OUT3_PIN (IC 1) */
#define R555_BCLK_OUT3_PIN_BCLK_OUT_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R555_BCLK_OUT3_PIN_BCLK_OUT_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R555_BCLK_OUT3_PIN_BCLK_OUT_PULL_IC_1     0x1    /* 1b	[4] */
#define R555_BCLK_OUT3_PIN_BCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R555_BCLK_OUT3_PIN_BCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R555_BCLK_OUT3_PIN_BCLK_OUT_SLEW_IC_1_MASK 0xC
#define R555_BCLK_OUT3_PIN_BCLK_OUT_SLEW_IC_1_SHIFT 2
#define R555_BCLK_OUT3_PIN_BCLK_OUT_PULL_IC_1_MASK 0x10
#define R555_BCLK_OUT3_PIN_BCLK_OUT_PULL_IC_1_SHIFT 4

/* LRCLK_IN0_PIN (IC 1) */
#define R556_LRCLK_IN0_PIN_LRCLK_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R556_LRCLK_IN0_PIN_LRCLK_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R556_LRCLK_IN0_PIN_LRCLK_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R556_LRCLK_IN0_PIN_LRCLK_IN_DRIVE_IC_1_MASK 0x3
#define R556_LRCLK_IN0_PIN_LRCLK_IN_DRIVE_IC_1_SHIFT 0
#define R556_LRCLK_IN0_PIN_LRCLK_IN_SLEW_IC_1_MASK 0xC
#define R556_LRCLK_IN0_PIN_LRCLK_IN_SLEW_IC_1_SHIFT 2
#define R556_LRCLK_IN0_PIN_LRCLK_IN_PULL_IC_1_MASK 0x10
#define R556_LRCLK_IN0_PIN_LRCLK_IN_PULL_IC_1_SHIFT 4

/* LRCLK_IN1_PIN (IC 1) */
#define R557_LRCLK_IN1_PIN_LRCLK_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R557_LRCLK_IN1_PIN_LRCLK_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R557_LRCLK_IN1_PIN_LRCLK_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R557_LRCLK_IN1_PIN_LRCLK_IN_DRIVE_IC_1_MASK 0x3
#define R557_LRCLK_IN1_PIN_LRCLK_IN_DRIVE_IC_1_SHIFT 0
#define R557_LRCLK_IN1_PIN_LRCLK_IN_SLEW_IC_1_MASK 0xC
#define R557_LRCLK_IN1_PIN_LRCLK_IN_SLEW_IC_1_SHIFT 2
#define R557_LRCLK_IN1_PIN_LRCLK_IN_PULL_IC_1_MASK 0x10
#define R557_LRCLK_IN1_PIN_LRCLK_IN_PULL_IC_1_SHIFT 4

/* LRCLK_IN2_PIN (IC 1) */
#define R558_LRCLK_IN2_PIN_LRCLK_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R558_LRCLK_IN2_PIN_LRCLK_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R558_LRCLK_IN2_PIN_LRCLK_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R558_LRCLK_IN2_PIN_LRCLK_IN_DRIVE_IC_1_MASK 0x3
#define R558_LRCLK_IN2_PIN_LRCLK_IN_DRIVE_IC_1_SHIFT 0
#define R558_LRCLK_IN2_PIN_LRCLK_IN_SLEW_IC_1_MASK 0xC
#define R558_LRCLK_IN2_PIN_LRCLK_IN_SLEW_IC_1_SHIFT 2
#define R558_LRCLK_IN2_PIN_LRCLK_IN_PULL_IC_1_MASK 0x10
#define R558_LRCLK_IN2_PIN_LRCLK_IN_PULL_IC_1_SHIFT 4

/* LRCLK_IN3_PIN (IC 1) */
#define R559_LRCLK_IN3_PIN_LRCLK_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R559_LRCLK_IN3_PIN_LRCLK_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R559_LRCLK_IN3_PIN_LRCLK_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R559_LRCLK_IN3_PIN_LRCLK_IN_DRIVE_IC_1_MASK 0x3
#define R559_LRCLK_IN3_PIN_LRCLK_IN_DRIVE_IC_1_SHIFT 0
#define R559_LRCLK_IN3_PIN_LRCLK_IN_SLEW_IC_1_MASK 0xC
#define R559_LRCLK_IN3_PIN_LRCLK_IN_SLEW_IC_1_SHIFT 2
#define R559_LRCLK_IN3_PIN_LRCLK_IN_PULL_IC_1_MASK 0x10
#define R559_LRCLK_IN3_PIN_LRCLK_IN_PULL_IC_1_SHIFT 4

/* LRCLK_OUT0_PIN (IC 1) */
#define R560_LRCLK_OUT0_PIN_LRCLK_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R560_LRCLK_OUT0_PIN_LRCLK_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R560_LRCLK_OUT0_PIN_LRCLK_OUT_PULL_IC_1   0x1    /* 1b	[4] */
#define R560_LRCLK_OUT0_PIN_LRCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R560_LRCLK_OUT0_PIN_LRCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R560_LRCLK_OUT0_PIN_LRCLK_OUT_SLEW_IC_1_MASK 0xC
#define R560_LRCLK_OUT0_PIN_LRCLK_OUT_SLEW_IC_1_SHIFT 2
#define R560_LRCLK_OUT0_PIN_LRCLK_OUT_PULL_IC_1_MASK 0x10
#define R560_LRCLK_OUT0_PIN_LRCLK_OUT_PULL_IC_1_SHIFT 4

/* LRCLK_OUT1_PIN (IC 1) */
#define R561_LRCLK_OUT1_PIN_LRCLK_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R561_LRCLK_OUT1_PIN_LRCLK_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R561_LRCLK_OUT1_PIN_LRCLK_OUT_PULL_IC_1   0x1    /* 1b	[4] */
#define R561_LRCLK_OUT1_PIN_LRCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R561_LRCLK_OUT1_PIN_LRCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R561_LRCLK_OUT1_PIN_LRCLK_OUT_SLEW_IC_1_MASK 0xC
#define R561_LRCLK_OUT1_PIN_LRCLK_OUT_SLEW_IC_1_SHIFT 2
#define R561_LRCLK_OUT1_PIN_LRCLK_OUT_PULL_IC_1_MASK 0x10
#define R561_LRCLK_OUT1_PIN_LRCLK_OUT_PULL_IC_1_SHIFT 4

/* LRCLK_OUT2_PIN (IC 1) */
#define R562_LRCLK_OUT2_PIN_LRCLK_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R562_LRCLK_OUT2_PIN_LRCLK_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R562_LRCLK_OUT2_PIN_LRCLK_OUT_PULL_IC_1   0x1    /* 1b	[4] */
#define R562_LRCLK_OUT2_PIN_LRCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R562_LRCLK_OUT2_PIN_LRCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R562_LRCLK_OUT2_PIN_LRCLK_OUT_SLEW_IC_1_MASK 0xC
#define R562_LRCLK_OUT2_PIN_LRCLK_OUT_SLEW_IC_1_SHIFT 2
#define R562_LRCLK_OUT2_PIN_LRCLK_OUT_PULL_IC_1_MASK 0x10
#define R562_LRCLK_OUT2_PIN_LRCLK_OUT_PULL_IC_1_SHIFT 4

/* LRCLK_OUT3_PIN (IC 1) */
#define R563_LRCLK_OUT3_PIN_LRCLK_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R563_LRCLK_OUT3_PIN_LRCLK_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R563_LRCLK_OUT3_PIN_LRCLK_OUT_PULL_IC_1   0x1    /* 1b	[4] */
#define R563_LRCLK_OUT3_PIN_LRCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R563_LRCLK_OUT3_PIN_LRCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R563_LRCLK_OUT3_PIN_LRCLK_OUT_SLEW_IC_1_MASK 0xC
#define R563_LRCLK_OUT3_PIN_LRCLK_OUT_SLEW_IC_1_SHIFT 2
#define R563_LRCLK_OUT3_PIN_LRCLK_OUT_PULL_IC_1_MASK 0x10
#define R563_LRCLK_OUT3_PIN_LRCLK_OUT_PULL_IC_1_SHIFT 4

/* SDATA_IN0_PIN (IC 1) */
#define R564_SDATA_IN0_PIN_SDATA_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R564_SDATA_IN0_PIN_SDATA_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R564_SDATA_IN0_PIN_SDATA_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R564_SDATA_IN0_PIN_SDATA_IN_DRIVE_IC_1_MASK 0x3
#define R564_SDATA_IN0_PIN_SDATA_IN_DRIVE_IC_1_SHIFT 0
#define R564_SDATA_IN0_PIN_SDATA_IN_SLEW_IC_1_MASK 0xC
#define R564_SDATA_IN0_PIN_SDATA_IN_SLEW_IC_1_SHIFT 2
#define R564_SDATA_IN0_PIN_SDATA_IN_PULL_IC_1_MASK 0x10
#define R564_SDATA_IN0_PIN_SDATA_IN_PULL_IC_1_SHIFT 4

/* SDATA_IN1_PIN (IC 1) */
#define R565_SDATA_IN1_PIN_SDATA_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R565_SDATA_IN1_PIN_SDATA_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R565_SDATA_IN1_PIN_SDATA_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R565_SDATA_IN1_PIN_SDATA_IN_DRIVE_IC_1_MASK 0x3
#define R565_SDATA_IN1_PIN_SDATA_IN_DRIVE_IC_1_SHIFT 0
#define R565_SDATA_IN1_PIN_SDATA_IN_SLEW_IC_1_MASK 0xC
#define R565_SDATA_IN1_PIN_SDATA_IN_SLEW_IC_1_SHIFT 2
#define R565_SDATA_IN1_PIN_SDATA_IN_PULL_IC_1_MASK 0x10
#define R565_SDATA_IN1_PIN_SDATA_IN_PULL_IC_1_SHIFT 4

