mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* SDATA_IN2_PIN (IC 1) */
#define R566_SDATA_IN2_PIN_SDATA_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R566_SDATA_IN2_PIN_SDATA_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R566_SDATA_IN2_PIN_SDATA_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R566_SDATA_IN2_PIN_SDATA_IN_DRIVE_IC_1_MASK 0x3
#define R566_SDATA_IN2_PIN_SDATA_IN_DRIVE_IC_1_SHIFT 0
#define R566_SDATA_IN2_PIN_SDATA_IN_SLEW_IC_1_MASK 0xC
#define R566_SDATA_IN2_PIN_SDATA_IN_SLEW_IC_1_SHIFT 2
#define R566_SDATA_IN2_PIN_SDATA_IN_PULL_IC_1_MASK 0x10
#define R566_SDATA_IN2_PIN_SDATA_IN_PULL_IC_1_SHIFT 4

/* SDATA_IN3_PIN (IC 1) */
#define R567_SDATA_IN3_PIN_SDATA_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R567_SDATA_IN3_PIN_SDATA_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R567_SDATA_IN3_PIN_SDATA_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R567_SDATA_IN3_PIN_SDATA_IN_DRIVE_IC_1_MASK 0x3
#define R567_SDATA_IN3_PIN_SDATA_IN_DRIVE_IC_1_SHIFT 0
#define R567_SDATA_IN3_PIN_SDATA_IN_SLEW_IC_1_MASK 0xC
#define R567_SDATA_IN3_PIN_SDATA_IN_SLEW_IC_1_SHIFT 2
#define R567_SDATA_IN3_PIN_SDATA_IN_PULL_IC_1_MASK 0x10
#define R567_SDATA_IN3_PIN_SDATA_IN_PULL_IC_1_SHIFT 4

/* SDATA_OUT0_PIN (IC 1) */
#define R568_SDATA_OUT0_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R568_SDATA_OUT0_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R568_SDATA_OUT0_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R568_SDATA_OUT0_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R568_SDATA_OUT0_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R568_SDATA_OUT0_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R568_SDATA_OUT0_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R568_SDATA_OUT0_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R568_SDATA_OUT0_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SDATA_OUT1_PIN (IC 1) */
#define R569_SDATA_OUT1_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R569_SDATA_OUT1_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R569_SDATA_OUT1_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R569_SDATA_OUT1_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R569_SDATA_OUT1_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R569_SDATA_OUT1_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R569_SDATA_OUT1_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R569_SDATA_OUT1_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R569_SDATA_OUT1_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SDATA_OUT2_PIN (IC 1) */
#define R570_SDATA_OUT2_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R570_SDATA_OUT2_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R570_SDATA_OUT2_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R570_SDATA_OUT2_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R570_SDATA_OUT2_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R570_SDATA_OUT2_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R570_SDATA_OUT2_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R570_SDATA_OUT2_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R570_SDATA_OUT2_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SDATA_OUT3_PIN (IC 1) */
#define R571_SDATA_OUT3_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R571_SDATA_OUT3_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R571_SDATA_OUT3_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R571_SDATA_OUT3_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R571_SDATA_OUT3_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R571_SDATA_OUT3_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R571_SDATA_OUT3_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R571_SDATA_OUT3_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R571_SDATA_OUT3_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SPDIF_TX_PIN (IC 1) */
#define R572_SPDIF_TX_PIN_SPDIF_TX_DRIVE_IC_1     0x0    /* 00b	[1:0] */
#define R572_SPDIF_TX_PIN_SPDIF_TX_SLEW_IC_1      0x2    /* 10b	[3:2] */
#define R572_SPDIF_TX_PIN_SPDIF_TX_PULL_IC_1      0x0    /* 0b	[4] */
#define R572_SPDIF_TX_PIN_SPDIF_TX_DRIVE_IC_1_MASK 0x3
#define R572_SPDIF_TX_PIN_SPDIF_TX_DRIVE_IC_1_SHIFT 0
#define R572_SPDIF_TX_PIN_SPDIF_TX_SLEW_IC_1_MASK 0xC
#define R572_SPDIF_TX_PIN_SPDIF_TX_SLEW_IC_1_SHIFT 2
#define R572_SPDIF_TX_PIN_SPDIF_TX_PULL_IC_1_MASK 0x10
#define R572_SPDIF_TX_PIN_SPDIF_TX_PULL_IC_1_SHIFT 4

/* SCLK_SCL_PIN (IC 1) */
#define R573_SCLK_SCL_PIN_SCLK_SCL_DRIVE_IC_1     0x0    /* 00b	[1:0] */
#define R573_SCLK_SCL_PIN_SCLK_SCL_SLEW_IC_1      0x2    /* 10b	[3:2] */
#define R573_SCLK_SCL_PIN_SCLK_SCL_PULL_IC_1      0x0    /* 0b	[4] */
#define R573_SCLK_SCL_PIN_SCLK_SCL_DRIVE_IC_1_MASK 0x3
#define R573_SCLK_SCL_PIN_SCLK_SCL_DRIVE_IC_1_SHIFT 0
#define R573_SCLK_SCL_PIN_SCLK_SCL_SLEW_IC_1_MASK 0xC
#define R573_SCLK_SCL_PIN_SCLK_SCL_SLEW_IC_1_SHIFT 2
#define R573_SCLK_SCL_PIN_SCLK_SCL_PULL_IC_1_MASK 0x10
#define R573_SCLK_SCL_PIN_SCLK_SCL_PULL_IC_1_SHIFT 4

/* MISO_SDA_PIN (IC 1) */
#define R574_MISO_SDA_PIN_MISO_SDA_DRIVE_IC_1     0x0    /* 00b	[1:0] */
#define R574_MISO_SDA_PIN_MISO_SDA_SLEW_IC_1      0x2    /* 10b	[3:2] */
#define R574_MISO_SDA_PIN_MISO_SDA_PULL_IC_1      0x0    /* 0b	[4] */
#define R574_MISO_SDA_PIN_MISO_SDA_DRIVE_IC_1_MASK 0x3
#define R574_MISO_SDA_PIN_MISO_SDA_DRIVE_IC_1_SHIFT 0
#define R574_MISO_SDA_PIN_MISO_SDA_SLEW_IC_1_MASK 0xC
#define R574_MISO_SDA_PIN_MISO_SDA_SLEW_IC_1_SHIFT 2
#define R574_MISO_SDA_PIN_MISO_SDA_PULL_IC_1_MASK 0x10
#define R574_MISO_SDA_PIN_MISO_SDA_PULL_IC_1_SHIFT 4

/* SS_PIN (IC 1) */
#define R575_SS_PIN_SS_DRIVE_IC_1                 0x0    /* 00b	[1:0] */
#define R575_SS_PIN_SS_SLEW_IC_1                  0x2    /* 10b	[3:2] */
#define R575_SS_PIN_SS_PULL_IC_1                  0x1    /* 1b	[4] */
#define R575_SS_PIN_SS_DRIVE_IC_1_MASK            0x3
#define R575_SS_PIN_SS_DRIVE_IC_1_SHIFT           0
#define R575_SS_PIN_SS_SLEW_IC_1_MASK             0xC
#define R575_SS_PIN_SS_SLEW_IC_1_SHIFT            2
#define R575_SS_PIN_SS_PULL_IC_1_MASK             0x10
#define R575_SS_PIN_SS_PULL_IC_1_SHIFT            4

/* MOSI_ADDR1_PIN (IC 1) */
#define R576_MOSI_ADDR1_PIN_MOSI_ADDR1_DRIVE_IC_1 0x0    /* 00b	[1:0] */
#define R576_MOSI_ADDR1_PIN_MOSI_ADDR1_SLEW_IC_1  0x2    /* 10b	[3:2] */
#define R576_MOSI_ADDR1_PIN_MOSI_ADDR1_PULL_IC_1  0x1    /* 1b	[4] */
#define R576_MOSI_ADDR1_PIN_MOSI_ADDR1_DRIVE_IC_1_MASK 0x3
#define R576_MOSI_ADDR1_PIN_MOSI_ADDR1_DRIVE_IC_1_SHIFT 0
#define R576_MOSI_ADDR1_PIN_MOSI_ADDR1_SLEW_IC_1_MASK 0xC
#define R576_MOSI_ADDR1_PIN_MOSI_ADDR1_SLEW_IC_1_SHIFT 2
#define R576_MOSI_ADDR1_PIN_MOSI_ADDR1_PULL_IC_1_MASK 0x10
#define R576_MOSI_ADDR1_PIN_MOSI_ADDR1_PULL_IC_1_SHIFT 4

/* SCLK_SCL_M_PIN (IC 1) */
#define R577_SCLK_SCL_M_PIN_SCLK_SCL_M_DRIVE_IC_1 0x0    /* 00b	[1:0] */
#define R577_SCLK_SCL_M_PIN_SCLK_SCL_M_SLEW_IC_1  0x2    /* 10b	[3:2] */
#define R577_SCLK_SCL_M_PIN_SCLK_SCL_M_PULL_IC_1  0x0    /* 0b	[4] */
#define R577_SCLK_SCL_M_PIN_SCLK_SCL_M_DRIVE_IC_1_MASK 0x3
#define R577_SCLK_SCL_M_PIN_SCLK_SCL_M_DRIVE_IC_1_SHIFT 0
#define R577_SCLK_SCL_M_PIN_SCLK_SCL_M_SLEW_IC_1_MASK 0xC
#define R577_SCLK_SCL_M_PIN_SCLK_SCL_M_SLEW_IC_1_SHIFT 2
#define R577_SCLK_SCL_M_PIN_SCLK_SCL_M_PULL_IC_1_MASK 0x10
#define R577_SCLK_SCL_M_PIN_SCLK_SCL_M_PULL_IC_1_SHIFT 4

/* MISO_SDA_M_PIN (IC 1) */
#define R578_MISO_SDA_M_PIN_MISO_SDA_M_DRIVE_IC_1 0x0    /* 00b	[1:0] */
#define R578_MISO_SDA_M_PIN_MISO_SDA_M_SLEW_IC_1  0x2    /* 10b	[3:2] */
#define R578_MISO_SDA_M_PIN_MISO_SDA_M_PULL_IC_1  0x0    /* 0b	[4] */
#define R578_MISO_SDA_M_PIN_MISO_SDA_M_DRIVE_IC_1_MASK 0x3
#define R578_MISO_SDA_M_PIN_MISO_SDA_M_DRIVE_IC_1_SHIFT 0
#define R578_MISO_SDA_M_PIN_MISO_SDA_M_SLEW_IC_1_MASK 0xC
#define R578_MISO_SDA_M_PIN_MISO_SDA_M_SLEW_IC_1_SHIFT 2
#define R578_MISO_SDA_M_PIN_MISO_SDA_M_PULL_IC_1_MASK 0x10
#define R578_MISO_SDA_M_PIN_MISO_SDA_M_PULL_IC_1_SHIFT 4

/* SS_M_PIN (IC 1) */
#define R579_SS_M_PIN_SS_M_DRIVE_IC_1             0x0    /* 00b	[1:0] */
#define R579_SS_M_PIN_SS_M_SLEW_IC_1              0x2    /* 10b	[3:2] */
#define R579_SS_M_PIN_SS_M_PULL_IC_1              0x1    /* 1b	[4] */
#define R579_SS_M_PIN_SS_M_DRIVE_IC_1_MASK        0x3
#define R579_SS_M_PIN_SS_M_DRIVE_IC_1_SHIFT       0
#define R579_SS_M_PIN_SS_M_SLEW_IC_1_MASK         0xC
#define R579_SS_M_PIN_SS_M_SLEW_IC_1_SHIFT        2
#define R579_SS_M_PIN_SS_M_PULL_IC_1_MASK         0x10
#define R579_SS_M_PIN_SS_M_PULL_IC_1_SHIFT        4

