mregueira/AudioDSP-v3.1.1/AudioDSP-v3.1.1/DOC/software/STM32/Core/Inc/DSP/DSP_IC_1_REG.h
/* MOSI_M_PIN (IC 1) */
#define R580_MOSI_M_PIN_MOSI_M_DRIVE_IC_1         0x0    /* 00b	[1:0] */
#define R580_MOSI_M_PIN_MOSI_M_SLEW_IC_1          0x2    /* 10b	[3:2] */
#define R580_MOSI_M_PIN_MOSI_M_PULL_IC_1          0x1    /* 1b	[4] */
#define R580_MOSI_M_PIN_MOSI_M_DRIVE_IC_1_MASK    0x3
#define R580_MOSI_M_PIN_MOSI_M_DRIVE_IC_1_SHIFT   0
#define R580_MOSI_M_PIN_MOSI_M_SLEW_IC_1_MASK     0xC
#define R580_MOSI_M_PIN_MOSI_M_SLEW_IC_1_SHIFT    2
#define R580_MOSI_M_PIN_MOSI_M_PULL_IC_1_MASK     0x10
#define R580_MOSI_M_PIN_MOSI_M_PULL_IC_1_SHIFT    4

/* MP6_PIN (IC 1) */
#define R581_MP6_PIN_MP6_DRIVE_IC_1               0x0    /* 00b	[1:0] */
#define R581_MP6_PIN_MP6_SLEW_IC_1                0x2    /* 10b	[3:2] */
#define R581_MP6_PIN_MP6_PULL_IC_1                0x1    /* 1b	[4] */
#define R581_MP6_PIN_MP6_DRIVE_IC_1_MASK          0x3
#define R581_MP6_PIN_MP6_DRIVE_IC_1_SHIFT         0
#define R581_MP6_PIN_MP6_SLEW_IC_1_MASK           0xC
#define R581_MP6_PIN_MP6_SLEW_IC_1_SHIFT          2
#define R581_MP6_PIN_MP6_PULL_IC_1_MASK           0x10
#define R581_MP6_PIN_MP6_PULL_IC_1_SHIFT          4

/* MP7_PIN (IC 1) */
#define R582_MP7_PIN_MP7_DRIVE_IC_1               0x0    /* 00b	[1:0] */
#define R582_MP7_PIN_MP7_SLEW_IC_1                0x2    /* 10b	[3:2] */
#define R582_MP7_PIN_MP7_PULL_IC_1                0x1    /* 1b	[4] */
#define R582_MP7_PIN_MP7_DRIVE_IC_1_MASK          0x3
#define R582_MP7_PIN_MP7_DRIVE_IC_1_SHIFT         0
#define R582_MP7_PIN_MP7_SLEW_IC_1_MASK           0xC
#define R582_MP7_PIN_MP7_SLEW_IC_1_SHIFT          2
#define R582_MP7_PIN_MP7_PULL_IC_1_MASK           0x10
#define R582_MP7_PIN_MP7_PULL_IC_1_SHIFT          4

/* CLKOUT_PIN (IC 1) */
#define R583_CLKOUT_PIN_CLKOUT_DRIVE_IC_1         0x0    /* 00b	[1:0] */
#define R583_CLKOUT_PIN_CLKOUT_SLEW_IC_1          0x2    /* 10b	[3:2] */
#define R583_CLKOUT_PIN_CLKOUT_PULL_IC_1          0x0    /* 0b	[4] */
#define R583_CLKOUT_PIN_CLKOUT_DRIVE_IC_1_MASK    0x3
#define R583_CLKOUT_PIN_CLKOUT_DRIVE_IC_1_SHIFT   0
#define R583_CLKOUT_PIN_CLKOUT_SLEW_IC_1_MASK     0xC
#define R583_CLKOUT_PIN_CLKOUT_SLEW_IC_1_SHIFT    2
#define R583_CLKOUT_PIN_CLKOUT_PULL_IC_1_MASK     0x10
#define R583_CLKOUT_PIN_CLKOUT_PULL_IC_1_SHIFT    4

/* SOFT_RESET (IC 1) */
#define R584_SOFTWARE_RESET_IC_1                  0x1    /* 1b	[0] */
#define R584_SOFTWARE_RESET_IC_1_MASK             0x1
#define R584_SOFTWARE_RESET_IC_1_SHIFT            0

/* SECOND_PAGE_ENABLE (IC 1) */
#define R585_SECOND_PAGE_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R585_SECOND_PAGE_ENABLE_IC_1_MASK         0x1
#define R585_SECOND_PAGE_ENABLE_IC_1_SHIFT        0

#endif
